espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** DMAC_ID0_REG register
 *  NA
 */
#define DMAC_ID0_REG (DR_REG_DMAC_BASE + 0x0)
/** DMAC_DMAC_ID : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_DMAC_ID    0xFFFFFFFFU
#define DMAC_DMAC_ID_M  (DMAC_DMAC_ID_V << DMAC_DMAC_ID_S)
#define DMAC_DMAC_ID_V  0xFFFFFFFFU
#define DMAC_DMAC_ID_S  0

/** DMAC_COMPVER0_REG register
 *  NA
 */
#define DMAC_COMPVER0_REG (DR_REG_DMAC_BASE + 0x8)
/** DMAC_DMAC_COMPVER : RO; bitpos: [31:0]; default: 842018858;
 *  NA
 */
#define DMAC_DMAC_COMPVER    0xFFFFFFFFU
#define DMAC_DMAC_COMPVER_M  (DMAC_DMAC_COMPVER_V << DMAC_DMAC_COMPVER_S)
#define DMAC_DMAC_COMPVER_V  0xFFFFFFFFU
#define DMAC_DMAC_COMPVER_S  0

/** DMAC_CFG0_REG register
 *  NA
 */
#define DMAC_CFG0_REG (DR_REG_DMAC_BASE + 0x10)
/** DMAC_DMAC_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_DMAC_EN    (BIT(0))
#define DMAC_DMAC_EN_M  (DMAC_DMAC_EN_V << DMAC_DMAC_EN_S)
#define DMAC_DMAC_EN_V  0x00000001U
#define DMAC_DMAC_EN_S  0
/** DMAC_INT_EN : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_INT_EN    (BIT(1))
#define DMAC_INT_EN_M  (DMAC_INT_EN_V << DMAC_INT_EN_S)
#define DMAC_INT_EN_V  0x00000001U
#define DMAC_INT_EN_S  1

/** DMAC_CHEN0_REG register
 *  NA
 */
#define DMAC_CHEN0_REG (DR_REG_DMAC_BASE + 0x18)
/** DMAC_CH1_EN : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_EN    (BIT(0))
#define DMAC_CH1_EN_M  (DMAC_CH1_EN_V << DMAC_CH1_EN_S)
#define DMAC_CH1_EN_V  0x00000001U
#define DMAC_CH1_EN_S  0
/** DMAC_CH2_EN : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH2_EN    (BIT(1))
#define DMAC_CH2_EN_M  (DMAC_CH2_EN_V << DMAC_CH2_EN_S)
#define DMAC_CH2_EN_V  0x00000001U
#define DMAC_CH2_EN_S  1
/** DMAC_CH3_EN : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH3_EN    (BIT(2))
#define DMAC_CH3_EN_M  (DMAC_CH3_EN_V << DMAC_CH3_EN_S)
#define DMAC_CH3_EN_V  0x00000001U
#define DMAC_CH3_EN_S  2
/** DMAC_CH4_EN : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH4_EN    (BIT(3))
#define DMAC_CH4_EN_M  (DMAC_CH4_EN_V << DMAC_CH4_EN_S)
#define DMAC_CH4_EN_V  0x00000001U
#define DMAC_CH4_EN_S  3
/** DMAC_CH1_EN_WE : WO; bitpos: [8]; default: 0;
 *  NA
 */
#define DMAC_CH1_EN_WE    (BIT(8))
#define DMAC_CH1_EN_WE_M  (DMAC_CH1_EN_WE_V << DMAC_CH1_EN_WE_S)
#define DMAC_CH1_EN_WE_V  0x00000001U
#define DMAC_CH1_EN_WE_S  8
/** DMAC_CH2_EN_WE : WO; bitpos: [9]; default: 0;
 *  NA
 */
#define DMAC_CH2_EN_WE    (BIT(9))
#define DMAC_CH2_EN_WE_M  (DMAC_CH2_EN_WE_V << DMAC_CH2_EN_WE_S)
#define DMAC_CH2_EN_WE_V  0x00000001U
#define DMAC_CH2_EN_WE_S  9
/** DMAC_CH3_EN_WE : WO; bitpos: [10]; default: 0;
 *  NA
 */
#define DMAC_CH3_EN_WE    (BIT(10))
#define DMAC_CH3_EN_WE_M  (DMAC_CH3_EN_WE_V << DMAC_CH3_EN_WE_S)
#define DMAC_CH3_EN_WE_V  0x00000001U
#define DMAC_CH3_EN_WE_S  10
/** DMAC_CH4_EN_WE : WO; bitpos: [11]; default: 0;
 *  NA
 */
#define DMAC_CH4_EN_WE    (BIT(11))
#define DMAC_CH4_EN_WE_M  (DMAC_CH4_EN_WE_V << DMAC_CH4_EN_WE_S)
#define DMAC_CH4_EN_WE_V  0x00000001U
#define DMAC_CH4_EN_WE_S  11
/** DMAC_CH1_SUSP : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_CH1_SUSP    (BIT(16))
#define DMAC_CH1_SUSP_M  (DMAC_CH1_SUSP_V << DMAC_CH1_SUSP_S)
#define DMAC_CH1_SUSP_V  0x00000001U
#define DMAC_CH1_SUSP_S  16
/** DMAC_CH2_SUSP : R/W; bitpos: [17]; default: 0;
 *  NA
 */
#define DMAC_CH2_SUSP    (BIT(17))
#define DMAC_CH2_SUSP_M  (DMAC_CH2_SUSP_V << DMAC_CH2_SUSP_S)
#define DMAC_CH2_SUSP_V  0x00000001U
#define DMAC_CH2_SUSP_S  17
/** DMAC_CH3_SUSP : R/W; bitpos: [18]; default: 0;
 *  NA
 */
#define DMAC_CH3_SUSP    (BIT(18))
#define DMAC_CH3_SUSP_M  (DMAC_CH3_SUSP_V << DMAC_CH3_SUSP_S)
#define DMAC_CH3_SUSP_V  0x00000001U
#define DMAC_CH3_SUSP_S  18
/** DMAC_CH4_SUSP : R/W; bitpos: [19]; default: 0;
 *  NA
 */
#define DMAC_CH4_SUSP    (BIT(19))
#define DMAC_CH4_SUSP_M  (DMAC_CH4_SUSP_V << DMAC_CH4_SUSP_S)
#define DMAC_CH4_SUSP_V  0x00000001U
#define DMAC_CH4_SUSP_S  19
/** DMAC_CH1_SUSP_WE : WO; bitpos: [24]; default: 0;
 *  NA
 */
#define DMAC_CH1_SUSP_WE    (BIT(24))
#define DMAC_CH1_SUSP_WE_M  (DMAC_CH1_SUSP_WE_V << DMAC_CH1_SUSP_WE_S)
#define DMAC_CH1_SUSP_WE_V  0x00000001U
#define DMAC_CH1_SUSP_WE_S  24
/** DMAC_CH2_SUSP_WE : WO; bitpos: [25]; default: 0;
 *  NA
 */
#define DMAC_CH2_SUSP_WE    (BIT(25))
#define DMAC_CH2_SUSP_WE_M  (DMAC_CH2_SUSP_WE_V << DMAC_CH2_SUSP_WE_S)
#define DMAC_CH2_SUSP_WE_V  0x00000001U
#define DMAC_CH2_SUSP_WE_S  25
/** DMAC_CH3_SUSP_WE : WO; bitpos: [26]; default: 0;
 *  NA
 */
#define DMAC_CH3_SUSP_WE    (BIT(26))
#define DMAC_CH3_SUSP_WE_M  (DMAC_CH3_SUSP_WE_V << DMAC_CH3_SUSP_WE_S)
#define DMAC_CH3_SUSP_WE_V  0x00000001U
#define DMAC_CH3_SUSP_WE_S  26
/** DMAC_CH4_SUSP_WE : WO; bitpos: [27]; default: 0;
 *  NA
 */
#define DMAC_CH4_SUSP_WE    (BIT(27))
#define DMAC_CH4_SUSP_WE_M  (DMAC_CH4_SUSP_WE_V << DMAC_CH4_SUSP_WE_S)
#define DMAC_CH4_SUSP_WE_V  0x00000001U
#define DMAC_CH4_SUSP_WE_S  27

/** DMAC_CHEN1_REG register
 *  NA
 */
#define DMAC_CHEN1_REG (DR_REG_DMAC_BASE + 0x1c)
/** DMAC_CH1_ABORT : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_ABORT    (BIT(0))
#define DMAC_CH1_ABORT_M  (DMAC_CH1_ABORT_V << DMAC_CH1_ABORT_S)
#define DMAC_CH1_ABORT_V  0x00000001U
#define DMAC_CH1_ABORT_S  0
/** DMAC_CH2_ABORT : R/W; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH2_ABORT    (BIT(1))
#define DMAC_CH2_ABORT_M  (DMAC_CH2_ABORT_V << DMAC_CH2_ABORT_S)
#define DMAC_CH2_ABORT_V  0x00000001U
#define DMAC_CH2_ABORT_S  1
/** DMAC_CH3_ABORT : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH3_ABORT    (BIT(2))
#define DMAC_CH3_ABORT_M  (DMAC_CH3_ABORT_V << DMAC_CH3_ABORT_S)
#define DMAC_CH3_ABORT_V  0x00000001U
#define DMAC_CH3_ABORT_S  2
/** DMAC_CH4_ABORT : R/W; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH4_ABORT    (BIT(3))
#define DMAC_CH4_ABORT_M  (DMAC_CH4_ABORT_V << DMAC_CH4_ABORT_S)
#define DMAC_CH4_ABORT_V  0x00000001U
#define DMAC_CH4_ABORT_S  3
/** DMAC_CH1_ABORT_WE : WO; bitpos: [8]; default: 0;
 *  NA
 */
#define DMAC_CH1_ABORT_WE    (BIT(8))
#define DMAC_CH1_ABORT_WE_M  (DMAC_CH1_ABORT_WE_V << DMAC_CH1_ABORT_WE_S)
#define DMAC_CH1_ABORT_WE_V  0x00000001U
#define DMAC_CH1_ABORT_WE_S  8
/** DMAC_CH2_ABORT_WE : WO; bitpos: [9]; default: 0;
 *  NA
 */
#define DMAC_CH2_ABORT_WE    (BIT(9))
#define DMAC_CH2_ABORT_WE_M  (DMAC_CH2_ABORT_WE_V << DMAC_CH2_ABORT_WE_S)
#define DMAC_CH2_ABORT_WE_V  0x00000001U
#define DMAC_CH2_ABORT_WE_S  9
/** DMAC_CH3_ABORT_WE : WO; bitpos: [10]; default: 0;
 *  NA
 */
#define DMAC_CH3_ABORT_WE    (BIT(10))
#define DMAC_CH3_ABORT_WE_M  (DMAC_CH3_ABORT_WE_V << DMAC_CH3_ABORT_WE_S)
#define DMAC_CH3_ABORT_WE_V  0x00000001U
#define DMAC_CH3_ABORT_WE_S  10
/** DMAC_CH4_ABORT_WE : WO; bitpos: [11]; default: 0;
 *  NA
 */
#define DMAC_CH4_ABORT_WE    (BIT(11))
#define DMAC_CH4_ABORT_WE_M  (DMAC_CH4_ABORT_WE_V << DMAC_CH4_ABORT_WE_S)
#define DMAC_CH4_ABORT_WE_V  0x00000001U
#define DMAC_CH4_ABORT_WE_S  11

/** DMAC_INTSTATUS0_REG register
 *  NA
 */
#define DMAC_INTSTATUS0_REG (DR_REG_DMAC_BASE + 0x30)
/** DMAC_CH1_INTSTAT : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_INTSTAT    (BIT(0))
#define DMAC_CH1_INTSTAT_M  (DMAC_CH1_INTSTAT_V << DMAC_CH1_INTSTAT_S)
#define DMAC_CH1_INTSTAT_V  0x00000001U
#define DMAC_CH1_INTSTAT_S  0
/** DMAC_CH2_INTSTAT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH2_INTSTAT    (BIT(1))
#define DMAC_CH2_INTSTAT_M  (DMAC_CH2_INTSTAT_V << DMAC_CH2_INTSTAT_S)
#define DMAC_CH2_INTSTAT_V  0x00000001U
#define DMAC_CH2_INTSTAT_S  1
/** DMAC_CH3_INTSTAT : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH3_INTSTAT    (BIT(2))
#define DMAC_CH3_INTSTAT_M  (DMAC_CH3_INTSTAT_V << DMAC_CH3_INTSTAT_S)
#define DMAC_CH3_INTSTAT_V  0x00000001U
#define DMAC_CH3_INTSTAT_S  2
/** DMAC_CH4_INTSTAT : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH4_INTSTAT    (BIT(3))
#define DMAC_CH4_INTSTAT_M  (DMAC_CH4_INTSTAT_V << DMAC_CH4_INTSTAT_S)
#define DMAC_CH4_INTSTAT_V  0x00000001U
#define DMAC_CH4_INTSTAT_S  3
/** DMAC_COMMONREG_INTSTAT : RO; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_COMMONREG_INTSTAT    (BIT(16))
#define DMAC_COMMONREG_INTSTAT_M  (DMAC_COMMONREG_INTSTAT_V << DMAC_COMMONREG_INTSTAT_S)
#define DMAC_COMMONREG_INTSTAT_V  0x00000001U
#define DMAC_COMMONREG_INTSTAT_S  16

/** DMAC_COMMONREG_INTCLEAR0_REG register
 *  NA
 */
#define DMAC_COMMONREG_INTCLEAR0_REG (DR_REG_DMAC_BASE + 0x38)
/** DMAC_CLEAR_SLVIF_COMMONREG_DEC_ERR_INTSTAT : WO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_SLVIF_COMMONREG_DEC_ERR_INTSTAT    (BIT(0))
#define DMAC_CLEAR_SLVIF_COMMONREG_DEC_ERR_INTSTAT_M  (DMAC_CLEAR_SLVIF_COMMONREG_DEC_ERR_INTSTAT_V << DMAC_CLEAR_SLVIF_COMMONREG_DEC_ERR_INTSTAT_S)
#define DMAC_CLEAR_SLVIF_COMMONREG_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_SLVIF_COMMONREG_DEC_ERR_INTSTAT_S  0
/** DMAC_CLEAR_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT    (BIT(1))
#define DMAC_CLEAR_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_M  (DMAC_CLEAR_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_V << DMAC_CLEAR_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_S)
#define DMAC_CLEAR_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_S  1
/** DMAC_CLEAR_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT : WO; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT    (BIT(2))
#define DMAC_CLEAR_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_M  (DMAC_CLEAR_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_V << DMAC_CLEAR_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_S)
#define DMAC_CLEAR_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_S  2
/** DMAC_CLEAR_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT    (BIT(3))
#define DMAC_CLEAR_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_M  (DMAC_CLEAR_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_V << DMAC_CLEAR_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_S)
#define DMAC_CLEAR_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_S  3
/** DMAC_CLEAR_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT : WO; bitpos: [7]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT    (BIT(7))
#define DMAC_CLEAR_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_M  (DMAC_CLEAR_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_V << DMAC_CLEAR_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_S)
#define DMAC_CLEAR_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_S  7
/** DMAC_CLEAR_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT : WO; bitpos: [8]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT    (BIT(8))
#define DMAC_CLEAR_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_M  (DMAC_CLEAR_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_V << DMAC_CLEAR_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_S)
#define DMAC_CLEAR_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_S  8
/** DMAC_CLEAR_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT : WO; bitpos: [9]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT    (BIT(9))
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_V << DMAC_CLEAR_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_S  9
/** DMAC_CLEAR_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT : WO; bitpos: [10]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT    (BIT(10))
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_CLEAR_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_S  10
/** DMAC_CLEAR_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT : WO; bitpos: [11]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT    (BIT(11))
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_V << DMAC_CLEAR_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_S  11
/** DMAC_CLEAR_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT : WO; bitpos: [12]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT    (BIT(12))
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_CLEAR_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_S  12
/** DMAC_CLEAR_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT : WO; bitpos: [13]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT    (BIT(13))
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_V << DMAC_CLEAR_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_S  13
/** DMAC_CLEAR_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT : WO; bitpos: [14]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT    (BIT(14))
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_CLEAR_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_S  14
/** DMAC_CLEAR_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT : WO; bitpos: [15]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT    (BIT(15))
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_V << DMAC_CLEAR_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_S  15
/** DMAC_CLEAR_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT : WO; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT    (BIT(16))
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_CLEAR_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_S  16
/** DMAC_CLEAR_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT : WO; bitpos: [17]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT    (BIT(17))
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_V << DMAC_CLEAR_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_S  17
/** DMAC_CLEAR_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT : WO; bitpos: [18]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT    (BIT(18))
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_CLEAR_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_S  18
/** DMAC_CLEAR_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT : WO; bitpos: [19]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT    (BIT(19))
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_V << DMAC_CLEAR_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_S  19
/** DMAC_CLEAR_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT : WO; bitpos: [20]; default: 0;
 *  NA
 */
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT    (BIT(20))
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_CLEAR_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_CLEAR_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CLEAR_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_S  20

