espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_COMMONREG_INTSTATUS0_REG register
 *  NA
 */
#define DMAC_COMMONREG_INTSTATUS0_REG (DR_REG_DMAC_BASE + 0x50)
/** DMAC_SLVIF_COMMONREG_DEC_ERR_INTSTAT : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_SLVIF_COMMONREG_DEC_ERR_INTSTAT    (BIT(0))
#define DMAC_SLVIF_COMMONREG_DEC_ERR_INTSTAT_M  (DMAC_SLVIF_COMMONREG_DEC_ERR_INTSTAT_V << DMAC_SLVIF_COMMONREG_DEC_ERR_INTSTAT_S)
#define DMAC_SLVIF_COMMONREG_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_SLVIF_COMMONREG_DEC_ERR_INTSTAT_S  0
/** DMAC_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT    (BIT(1))
#define DMAC_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_M  (DMAC_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_V << DMAC_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_S)
#define DMAC_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_V  0x00000001U
#define DMAC_SLVIF_COMMONREG_WR2RO_ERR_INTSTAT_S  1
/** DMAC_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT : RO; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT    (BIT(2))
#define DMAC_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_M  (DMAC_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_V << DMAC_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_S)
#define DMAC_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_V  0x00000001U
#define DMAC_SLVIF_COMMONREG_RD2WO_ERR_INTSTAT_S  2
/** DMAC_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT    (BIT(3))
#define DMAC_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_M  (DMAC_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_V << DMAC_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_S)
#define DMAC_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_V  0x00000001U
#define DMAC_SLVIF_COMMONREG_WRONHOLD_ERR_INTSTAT_S  3
/** DMAC_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define DMAC_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT    (BIT(7))
#define DMAC_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_M  (DMAC_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_V << DMAC_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_S)
#define DMAC_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_V  0x00000001U
#define DMAC_SLVIF_COMMONREG_WRPARITY_ERR_INTSTAT_S  7
/** DMAC_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define DMAC_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT    (BIT(8))
#define DMAC_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_M  (DMAC_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_V << DMAC_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_S)
#define DMAC_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_SLVIF_UNDEFINEDREG_DEC_ERR_INTSTAT_S  8
/** DMAC_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT : RO; bitpos: [9]; default: 0;
 *  NA
 */
#define DMAC_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT    (BIT(9))
#define DMAC_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_M  (DMAC_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_V << DMAC_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF1_RCH0_ECCPROT_CORRERR_INTSTAT_S  9
/** DMAC_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT : RO; bitpos: [10]; default: 0;
 *  NA
 */
#define DMAC_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT    (BIT(10))
#define DMAC_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF1_RCH0_ECCPROT_UNCORRERR_INTSTAT_S  10
/** DMAC_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT : RO; bitpos: [11]; default: 0;
 *  NA
 */
#define DMAC_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT    (BIT(11))
#define DMAC_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_M  (DMAC_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_V << DMAC_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF1_RCH1_ECCPROT_CORRERR_INTSTAT_S  11
/** DMAC_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT : RO; bitpos: [12]; default: 0;
 *  NA
 */
#define DMAC_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT    (BIT(12))
#define DMAC_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF1_RCH1_ECCPROT_UNCORRERR_INTSTAT_S  12
/** DMAC_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT : RO; bitpos: [13]; default: 0;
 *  NA
 */
#define DMAC_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT    (BIT(13))
#define DMAC_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_M  (DMAC_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_V << DMAC_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF1_BCH_ECCPROT_CORRERR_INTSTAT_S  13
/** DMAC_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT : RO; bitpos: [14]; default: 0;
 *  NA
 */
#define DMAC_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT    (BIT(14))
#define DMAC_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF1_BCH_ECCPROT_UNCORRERR_INTSTAT_S  14
/** DMAC_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT : RO; bitpos: [15]; default: 0;
 *  NA
 */
#define DMAC_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT    (BIT(15))
#define DMAC_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_M  (DMAC_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_V << DMAC_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF2_RCH0_ECCPROT_CORRERR_INTSTAT_S  15
/** DMAC_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT : RO; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT    (BIT(16))
#define DMAC_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF2_RCH0_ECCPROT_UNCORRERR_INTSTAT_S  16
/** DMAC_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT : RO; bitpos: [17]; default: 0;
 *  NA
 */
#define DMAC_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT    (BIT(17))
#define DMAC_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_M  (DMAC_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_V << DMAC_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF2_RCH1_ECCPROT_CORRERR_INTSTAT_S  17
/** DMAC_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT : RO; bitpos: [18]; default: 0;
 *  NA
 */
#define DMAC_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT    (BIT(18))
#define DMAC_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF2_RCH1_ECCPROT_UNCORRERR_INTSTAT_S  18
/** DMAC_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT : RO; bitpos: [19]; default: 0;
 *  NA
 */
#define DMAC_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT    (BIT(19))
#define DMAC_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_M  (DMAC_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_V << DMAC_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_S)
#define DMAC_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF2_BCH_ECCPROT_CORRERR_INTSTAT_S  19
/** DMAC_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT : RO; bitpos: [20]; default: 0;
 *  NA
 */
#define DMAC_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT    (BIT(20))
#define DMAC_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_M  (DMAC_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_V << DMAC_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_S)
#define DMAC_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_MXIF2_BCH_ECCPROT_UNCORRERR_INTSTAT_S  20

/** DMAC_RESET0_REG register
 *  NA
 */
#define DMAC_RESET0_REG (DR_REG_DMAC_BASE + 0x58)
/** DMAC_DMAC_RST : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_DMAC_RST    (BIT(0))
#define DMAC_DMAC_RST_M  (DMAC_DMAC_RST_V << DMAC_DMAC_RST_S)
#define DMAC_DMAC_RST_V  0x00000001U
#define DMAC_DMAC_RST_S  0

/** DMAC_LOWPOWER_CFG0_REG register
 *  NA
 */
#define DMAC_LOWPOWER_CFG0_REG (DR_REG_DMAC_BASE + 0x60)
/** DMAC_GBL_CSLP_EN : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define DMAC_GBL_CSLP_EN    (BIT(0))
#define DMAC_GBL_CSLP_EN_M  (DMAC_GBL_CSLP_EN_V << DMAC_GBL_CSLP_EN_S)
#define DMAC_GBL_CSLP_EN_V  0x00000001U
#define DMAC_GBL_CSLP_EN_S  0
/** DMAC_CHNL_CSLP_EN : R/W; bitpos: [1]; default: 1;
 *  NA
 */
#define DMAC_CHNL_CSLP_EN    (BIT(1))
#define DMAC_CHNL_CSLP_EN_M  (DMAC_CHNL_CSLP_EN_V << DMAC_CHNL_CSLP_EN_S)
#define DMAC_CHNL_CSLP_EN_V  0x00000001U
#define DMAC_CHNL_CSLP_EN_S  1
/** DMAC_SBIU_CSLP_EN : R/W; bitpos: [2]; default: 1;
 *  NA
 */
#define DMAC_SBIU_CSLP_EN    (BIT(2))
#define DMAC_SBIU_CSLP_EN_M  (DMAC_SBIU_CSLP_EN_V << DMAC_SBIU_CSLP_EN_S)
#define DMAC_SBIU_CSLP_EN_V  0x00000001U
#define DMAC_SBIU_CSLP_EN_S  2
/** DMAC_MXIF_CSLP_EN : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_MXIF_CSLP_EN    (BIT(3))
#define DMAC_MXIF_CSLP_EN_M  (DMAC_MXIF_CSLP_EN_V << DMAC_MXIF_CSLP_EN_S)
#define DMAC_MXIF_CSLP_EN_V  0x00000001U
#define DMAC_MXIF_CSLP_EN_S  3

