espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH1_CFG1_REG register
 *  NA
 */
#define DMAC_CH1_CFG1_REG (DR_REG_DMAC_BASE + 0x124)
/** DMAC_CH1_TT_FC : R/W; bitpos: [2:0]; default: 3;
 *  NA
 */
#define DMAC_CH1_TT_FC    0x00000007U
#define DMAC_CH1_TT_FC_M  (DMAC_CH1_TT_FC_V << DMAC_CH1_TT_FC_S)
#define DMAC_CH1_TT_FC_V  0x00000007U
#define DMAC_CH1_TT_FC_S  0
/** DMAC_CH1_HS_SEL_SRC : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH1_HS_SEL_SRC    (BIT(3))
#define DMAC_CH1_HS_SEL_SRC_M  (DMAC_CH1_HS_SEL_SRC_V << DMAC_CH1_HS_SEL_SRC_S)
#define DMAC_CH1_HS_SEL_SRC_V  0x00000001U
#define DMAC_CH1_HS_SEL_SRC_S  3
/** DMAC_CH1_HS_SEL_DST : R/W; bitpos: [4]; default: 1;
 *  NA
 */
#define DMAC_CH1_HS_SEL_DST    (BIT(4))
#define DMAC_CH1_HS_SEL_DST_M  (DMAC_CH1_HS_SEL_DST_V << DMAC_CH1_HS_SEL_DST_S)
#define DMAC_CH1_HS_SEL_DST_V  0x00000001U
#define DMAC_CH1_HS_SEL_DST_S  4
/** DMAC_CH1_SRC_HWHS_POL : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH1_SRC_HWHS_POL    (BIT(5))
#define DMAC_CH1_SRC_HWHS_POL_M  (DMAC_CH1_SRC_HWHS_POL_V << DMAC_CH1_SRC_HWHS_POL_S)
#define DMAC_CH1_SRC_HWHS_POL_V  0x00000001U
#define DMAC_CH1_SRC_HWHS_POL_S  5
/** DMAC_CH1_DST_HWHS_POL : RO; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH1_DST_HWHS_POL    (BIT(6))
#define DMAC_CH1_DST_HWHS_POL_M  (DMAC_CH1_DST_HWHS_POL_V << DMAC_CH1_DST_HWHS_POL_S)
#define DMAC_CH1_DST_HWHS_POL_V  0x00000001U
#define DMAC_CH1_DST_HWHS_POL_S  6
/** DMAC_CH1_SRC_PER : R/W; bitpos: [8:7]; default: 0;
 *  NA
 */
#define DMAC_CH1_SRC_PER    0x00000003U
#define DMAC_CH1_SRC_PER_M  (DMAC_CH1_SRC_PER_V << DMAC_CH1_SRC_PER_S)
#define DMAC_CH1_SRC_PER_V  0x00000003U
#define DMAC_CH1_SRC_PER_S  7
/** DMAC_CH1_DST_PER : R/W; bitpos: [13:12]; default: 0;
 *  NA
 */
#define DMAC_CH1_DST_PER    0x00000003U
#define DMAC_CH1_DST_PER_M  (DMAC_CH1_DST_PER_V << DMAC_CH1_DST_PER_S)
#define DMAC_CH1_DST_PER_V  0x00000003U
#define DMAC_CH1_DST_PER_S  12
/** DMAC_CH1_CH_PRIOR : R/W; bitpos: [19:17]; default: 3;
 *  NA
 */
#define DMAC_CH1_CH_PRIOR    0x00000007U
#define DMAC_CH1_CH_PRIOR_M  (DMAC_CH1_CH_PRIOR_V << DMAC_CH1_CH_PRIOR_S)
#define DMAC_CH1_CH_PRIOR_V  0x00000007U
#define DMAC_CH1_CH_PRIOR_S  17
/** DMAC_CH1_LOCK_CH : RO; bitpos: [20]; default: 0;
 *  NA
 */
#define DMAC_CH1_LOCK_CH    (BIT(20))
#define DMAC_CH1_LOCK_CH_M  (DMAC_CH1_LOCK_CH_V << DMAC_CH1_LOCK_CH_S)
#define DMAC_CH1_LOCK_CH_V  0x00000001U
#define DMAC_CH1_LOCK_CH_S  20
/** DMAC_CH1_LOCK_CH_L : RO; bitpos: [22:21]; default: 0;
 *  NA
 */
#define DMAC_CH1_LOCK_CH_L    0x00000003U
#define DMAC_CH1_LOCK_CH_L_M  (DMAC_CH1_LOCK_CH_L_V << DMAC_CH1_LOCK_CH_L_S)
#define DMAC_CH1_LOCK_CH_L_V  0x00000003U
#define DMAC_CH1_LOCK_CH_L_S  21
/** DMAC_CH1_SRC_OSR_LMT : R/W; bitpos: [26:23]; default: 0;
 *  NA
 */
#define DMAC_CH1_SRC_OSR_LMT    0x0000000FU
#define DMAC_CH1_SRC_OSR_LMT_M  (DMAC_CH1_SRC_OSR_LMT_V << DMAC_CH1_SRC_OSR_LMT_S)
#define DMAC_CH1_SRC_OSR_LMT_V  0x0000000FU
#define DMAC_CH1_SRC_OSR_LMT_S  23
/** DMAC_CH1_DST_OSR_LMT : R/W; bitpos: [30:27]; default: 0;
 *  NA
 */
#define DMAC_CH1_DST_OSR_LMT    0x0000000FU
#define DMAC_CH1_DST_OSR_LMT_M  (DMAC_CH1_DST_OSR_LMT_V << DMAC_CH1_DST_OSR_LMT_S)
#define DMAC_CH1_DST_OSR_LMT_V  0x0000000FU
#define DMAC_CH1_DST_OSR_LMT_S  27

/** DMAC_CH1_LLP0_REG register
 *  NA
 */
#define DMAC_CH1_LLP0_REG (DR_REG_DMAC_BASE + 0x128)
/** DMAC_CH1_LMS : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_LMS    (BIT(0))
#define DMAC_CH1_LMS_M  (DMAC_CH1_LMS_V << DMAC_CH1_LMS_S)
#define DMAC_CH1_LMS_V  0x00000001U
#define DMAC_CH1_LMS_S  0
/** DMAC_CH1_LOC0 : R/W; bitpos: [31:6]; default: 0;
 *  NA
 */
#define DMAC_CH1_LOC0    0x03FFFFFFU
#define DMAC_CH1_LOC0_M  (DMAC_CH1_LOC0_V << DMAC_CH1_LOC0_S)
#define DMAC_CH1_LOC0_V  0x03FFFFFFU
#define DMAC_CH1_LOC0_S  6

/** DMAC_CH1_LLP1_REG register
 *  NA
 */
#define DMAC_CH1_LLP1_REG (DR_REG_DMAC_BASE + 0x12c)
/** DMAC_CH1_LOC1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH1_LOC1    0xFFFFFFFFU
#define DMAC_CH1_LOC1_M  (DMAC_CH1_LOC1_V << DMAC_CH1_LOC1_S)
#define DMAC_CH1_LOC1_V  0xFFFFFFFFU
#define DMAC_CH1_LOC1_S  0

/** DMAC_CH1_STATUS0_REG register
 *  NA
 */
#define DMAC_CH1_STATUS0_REG (DR_REG_DMAC_BASE + 0x130)
/** DMAC_CH1_CMPLTD_BLK_TFR_SIZE : RO; bitpos: [21:0]; default: 0;
 *  NA
 */
#define DMAC_CH1_CMPLTD_BLK_TFR_SIZE    0x003FFFFFU
#define DMAC_CH1_CMPLTD_BLK_TFR_SIZE_M  (DMAC_CH1_CMPLTD_BLK_TFR_SIZE_V << DMAC_CH1_CMPLTD_BLK_TFR_SIZE_S)
#define DMAC_CH1_CMPLTD_BLK_TFR_SIZE_V  0x003FFFFFU
#define DMAC_CH1_CMPLTD_BLK_TFR_SIZE_S  0

/** DMAC_CH1_STATUS1_REG register
 *  NA
 */
#define DMAC_CH1_STATUS1_REG (DR_REG_DMAC_BASE + 0x134)
/** DMAC_CH1_DATA_LEFT_IN_FIFO : RO; bitpos: [14:0]; default: 0;
 *  NA
 */
#define DMAC_CH1_DATA_LEFT_IN_FIFO    0x00007FFFU
#define DMAC_CH1_DATA_LEFT_IN_FIFO_M  (DMAC_CH1_DATA_LEFT_IN_FIFO_V << DMAC_CH1_DATA_LEFT_IN_FIFO_S)
#define DMAC_CH1_DATA_LEFT_IN_FIFO_V  0x00007FFFU
#define DMAC_CH1_DATA_LEFT_IN_FIFO_S  0

/** DMAC_CH1_SWHSSRC0_REG register
 *  NA
 */
#define DMAC_CH1_SWHSSRC0_REG (DR_REG_DMAC_BASE + 0x138)
/** DMAC_CH1_SWHS_REQ_SRC : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_REQ_SRC    (BIT(0))
#define DMAC_CH1_SWHS_REQ_SRC_M  (DMAC_CH1_SWHS_REQ_SRC_V << DMAC_CH1_SWHS_REQ_SRC_S)
#define DMAC_CH1_SWHS_REQ_SRC_V  0x00000001U
#define DMAC_CH1_SWHS_REQ_SRC_S  0
/** DMAC_CH1_SWHS_REQ_SRC_WE : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_REQ_SRC_WE    (BIT(1))
#define DMAC_CH1_SWHS_REQ_SRC_WE_M  (DMAC_CH1_SWHS_REQ_SRC_WE_V << DMAC_CH1_SWHS_REQ_SRC_WE_S)
#define DMAC_CH1_SWHS_REQ_SRC_WE_V  0x00000001U
#define DMAC_CH1_SWHS_REQ_SRC_WE_S  1
/** DMAC_CH1_SWHS_SGLREQ_SRC : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_SGLREQ_SRC    (BIT(2))
#define DMAC_CH1_SWHS_SGLREQ_SRC_M  (DMAC_CH1_SWHS_SGLREQ_SRC_V << DMAC_CH1_SWHS_SGLREQ_SRC_S)
#define DMAC_CH1_SWHS_SGLREQ_SRC_V  0x00000001U
#define DMAC_CH1_SWHS_SGLREQ_SRC_S  2
/** DMAC_CH1_SWHS_SGLREQ_SRC_WE : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_SGLREQ_SRC_WE    (BIT(3))
#define DMAC_CH1_SWHS_SGLREQ_SRC_WE_M  (DMAC_CH1_SWHS_SGLREQ_SRC_WE_V << DMAC_CH1_SWHS_SGLREQ_SRC_WE_S)
#define DMAC_CH1_SWHS_SGLREQ_SRC_WE_V  0x00000001U
#define DMAC_CH1_SWHS_SGLREQ_SRC_WE_S  3
/** DMAC_CH1_SWHS_LST_SRC : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_LST_SRC    (BIT(4))
#define DMAC_CH1_SWHS_LST_SRC_M  (DMAC_CH1_SWHS_LST_SRC_V << DMAC_CH1_SWHS_LST_SRC_S)
#define DMAC_CH1_SWHS_LST_SRC_V  0x00000001U
#define DMAC_CH1_SWHS_LST_SRC_S  4
/** DMAC_CH1_SWHS_LST_SRC_WE : WO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_LST_SRC_WE    (BIT(5))
#define DMAC_CH1_SWHS_LST_SRC_WE_M  (DMAC_CH1_SWHS_LST_SRC_WE_V << DMAC_CH1_SWHS_LST_SRC_WE_S)
#define DMAC_CH1_SWHS_LST_SRC_WE_V  0x00000001U
#define DMAC_CH1_SWHS_LST_SRC_WE_S  5

/** DMAC_CH1_SWHSDST0_REG register
 *  NA
 */
#define DMAC_CH1_SWHSDST0_REG (DR_REG_DMAC_BASE + 0x140)
/** DMAC_CH1_SWHS_REQ_DST : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_REQ_DST    (BIT(0))
#define DMAC_CH1_SWHS_REQ_DST_M  (DMAC_CH1_SWHS_REQ_DST_V << DMAC_CH1_SWHS_REQ_DST_S)
#define DMAC_CH1_SWHS_REQ_DST_V  0x00000001U
#define DMAC_CH1_SWHS_REQ_DST_S  0
/** DMAC_CH1_SWHS_REQ_DST_WE : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_REQ_DST_WE    (BIT(1))
#define DMAC_CH1_SWHS_REQ_DST_WE_M  (DMAC_CH1_SWHS_REQ_DST_WE_V << DMAC_CH1_SWHS_REQ_DST_WE_S)
#define DMAC_CH1_SWHS_REQ_DST_WE_V  0x00000001U
#define DMAC_CH1_SWHS_REQ_DST_WE_S  1
/** DMAC_CH1_SWHS_SGLREQ_DST : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_SGLREQ_DST    (BIT(2))
#define DMAC_CH1_SWHS_SGLREQ_DST_M  (DMAC_CH1_SWHS_SGLREQ_DST_V << DMAC_CH1_SWHS_SGLREQ_DST_S)
#define DMAC_CH1_SWHS_SGLREQ_DST_V  0x00000001U
#define DMAC_CH1_SWHS_SGLREQ_DST_S  2
/** DMAC_CH1_SWHS_SGLREQ_DST_WE : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_SGLREQ_DST_WE    (BIT(3))
#define DMAC_CH1_SWHS_SGLREQ_DST_WE_M  (DMAC_CH1_SWHS_SGLREQ_DST_WE_V << DMAC_CH1_SWHS_SGLREQ_DST_WE_S)
#define DMAC_CH1_SWHS_SGLREQ_DST_WE_V  0x00000001U
#define DMAC_CH1_SWHS_SGLREQ_DST_WE_S  3
/** DMAC_CH1_SWHS_LST_DST : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_LST_DST    (BIT(4))
#define DMAC_CH1_SWHS_LST_DST_M  (DMAC_CH1_SWHS_LST_DST_V << DMAC_CH1_SWHS_LST_DST_S)
#define DMAC_CH1_SWHS_LST_DST_V  0x00000001U
#define DMAC_CH1_SWHS_LST_DST_S  4
/** DMAC_CH1_SWHS_LST_DST_WE : WO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH1_SWHS_LST_DST_WE    (BIT(5))
#define DMAC_CH1_SWHS_LST_DST_WE_M  (DMAC_CH1_SWHS_LST_DST_WE_V << DMAC_CH1_SWHS_LST_DST_WE_S)
#define DMAC_CH1_SWHS_LST_DST_WE_V  0x00000001U
#define DMAC_CH1_SWHS_LST_DST_WE_S  5

/** DMAC_CH1_BLK_TFR_RESUMEREQ0_REG register
 *  NA
 */
#define DMAC_CH1_BLK_TFR_RESUMEREQ0_REG (DR_REG_DMAC_BASE + 0x148)
/** DMAC_CH1_BLK_TFR_RESUMEREQ : WO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_BLK_TFR_RESUMEREQ    (BIT(0))
#define DMAC_CH1_BLK_TFR_RESUMEREQ_M  (DMAC_CH1_BLK_TFR_RESUMEREQ_V << DMAC_CH1_BLK_TFR_RESUMEREQ_S)
#define DMAC_CH1_BLK_TFR_RESUMEREQ_V  0x00000001U
#define DMAC_CH1_BLK_TFR_RESUMEREQ_S  0

/** DMAC_CH1_AXI_ID0_REG register
 *  NA
 */
#define DMAC_CH1_AXI_ID0_REG (DR_REG_DMAC_BASE + 0x150)
/** DMAC_CH1_AXI_READ_ID_SUFFIX : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_AXI_READ_ID_SUFFIX    (BIT(0))
#define DMAC_CH1_AXI_READ_ID_SUFFIX_M  (DMAC_CH1_AXI_READ_ID_SUFFIX_V << DMAC_CH1_AXI_READ_ID_SUFFIX_S)
#define DMAC_CH1_AXI_READ_ID_SUFFIX_V  0x00000001U
#define DMAC_CH1_AXI_READ_ID_SUFFIX_S  0
/** DMAC_CH1_AXI_WRITE_ID_SUFFIX : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_CH1_AXI_WRITE_ID_SUFFIX    (BIT(16))
#define DMAC_CH1_AXI_WRITE_ID_SUFFIX_M  (DMAC_CH1_AXI_WRITE_ID_SUFFIX_V << DMAC_CH1_AXI_WRITE_ID_SUFFIX_S)
#define DMAC_CH1_AXI_WRITE_ID_SUFFIX_V  0x00000001U
#define DMAC_CH1_AXI_WRITE_ID_SUFFIX_S  16

