espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH1_INTSTATUS0_REG register
 *  NA
 */
#define DMAC_CH1_INTSTATUS0_REG (DR_REG_DMAC_BASE + 0x188)
/** DMAC_CH1_BLOCK_TFR_DONE_INTSTAT : RO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH1_BLOCK_TFR_DONE_INTSTAT    (BIT(0))
#define DMAC_CH1_BLOCK_TFR_DONE_INTSTAT_M  (DMAC_CH1_BLOCK_TFR_DONE_INTSTAT_V << DMAC_CH1_BLOCK_TFR_DONE_INTSTAT_S)
#define DMAC_CH1_BLOCK_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH1_BLOCK_TFR_DONE_INTSTAT_S  0
/** DMAC_CH1_DMA_TFR_DONE_INTSTAT : RO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH1_DMA_TFR_DONE_INTSTAT    (BIT(1))
#define DMAC_CH1_DMA_TFR_DONE_INTSTAT_M  (DMAC_CH1_DMA_TFR_DONE_INTSTAT_V << DMAC_CH1_DMA_TFR_DONE_INTSTAT_S)
#define DMAC_CH1_DMA_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH1_DMA_TFR_DONE_INTSTAT_S  1
/** DMAC_CH1_SRC_TRANSCOMP_INTSTAT : RO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH1_SRC_TRANSCOMP_INTSTAT    (BIT(3))
#define DMAC_CH1_SRC_TRANSCOMP_INTSTAT_M  (DMAC_CH1_SRC_TRANSCOMP_INTSTAT_V << DMAC_CH1_SRC_TRANSCOMP_INTSTAT_S)
#define DMAC_CH1_SRC_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH1_SRC_TRANSCOMP_INTSTAT_S  3
/** DMAC_CH1_DST_TRANSCOMP_INTSTAT : RO; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH1_DST_TRANSCOMP_INTSTAT    (BIT(4))
#define DMAC_CH1_DST_TRANSCOMP_INTSTAT_M  (DMAC_CH1_DST_TRANSCOMP_INTSTAT_V << DMAC_CH1_DST_TRANSCOMP_INTSTAT_S)
#define DMAC_CH1_DST_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH1_DST_TRANSCOMP_INTSTAT_S  4
/** DMAC_CH1_SRC_DEC_ERR_INTSTAT : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH1_SRC_DEC_ERR_INTSTAT    (BIT(5))
#define DMAC_CH1_SRC_DEC_ERR_INTSTAT_M  (DMAC_CH1_SRC_DEC_ERR_INTSTAT_V << DMAC_CH1_SRC_DEC_ERR_INTSTAT_S)
#define DMAC_CH1_SRC_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SRC_DEC_ERR_INTSTAT_S  5
/** DMAC_CH1_DST_DEC_ERR_INTSTAT : RO; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH1_DST_DEC_ERR_INTSTAT    (BIT(6))
#define DMAC_CH1_DST_DEC_ERR_INTSTAT_M  (DMAC_CH1_DST_DEC_ERR_INTSTAT_V << DMAC_CH1_DST_DEC_ERR_INTSTAT_S)
#define DMAC_CH1_DST_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_DST_DEC_ERR_INTSTAT_S  6
/** DMAC_CH1_SRC_SLV_ERR_INTSTAT : RO; bitpos: [7]; default: 0;
 *  NA
 */
#define DMAC_CH1_SRC_SLV_ERR_INTSTAT    (BIT(7))
#define DMAC_CH1_SRC_SLV_ERR_INTSTAT_M  (DMAC_CH1_SRC_SLV_ERR_INTSTAT_V << DMAC_CH1_SRC_SLV_ERR_INTSTAT_S)
#define DMAC_CH1_SRC_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SRC_SLV_ERR_INTSTAT_S  7
/** DMAC_CH1_DST_SLV_ERR_INTSTAT : RO; bitpos: [8]; default: 0;
 *  NA
 */
#define DMAC_CH1_DST_SLV_ERR_INTSTAT    (BIT(8))
#define DMAC_CH1_DST_SLV_ERR_INTSTAT_M  (DMAC_CH1_DST_SLV_ERR_INTSTAT_V << DMAC_CH1_DST_SLV_ERR_INTSTAT_S)
#define DMAC_CH1_DST_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_DST_SLV_ERR_INTSTAT_S  8
/** DMAC_CH1_LLI_RD_DEC_ERR_INTSTAT : RO; bitpos: [9]; default: 0;
 *  NA
 */
#define DMAC_CH1_LLI_RD_DEC_ERR_INTSTAT    (BIT(9))
#define DMAC_CH1_LLI_RD_DEC_ERR_INTSTAT_M  (DMAC_CH1_LLI_RD_DEC_ERR_INTSTAT_V << DMAC_CH1_LLI_RD_DEC_ERR_INTSTAT_S)
#define DMAC_CH1_LLI_RD_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_LLI_RD_DEC_ERR_INTSTAT_S  9
/** DMAC_CH1_LLI_WR_DEC_ERR_INTSTAT : RO; bitpos: [10]; default: 0;
 *  NA
 */
#define DMAC_CH1_LLI_WR_DEC_ERR_INTSTAT    (BIT(10))
#define DMAC_CH1_LLI_WR_DEC_ERR_INTSTAT_M  (DMAC_CH1_LLI_WR_DEC_ERR_INTSTAT_V << DMAC_CH1_LLI_WR_DEC_ERR_INTSTAT_S)
#define DMAC_CH1_LLI_WR_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_LLI_WR_DEC_ERR_INTSTAT_S  10
/** DMAC_CH1_LLI_RD_SLV_ERR_INTSTAT : RO; bitpos: [11]; default: 0;
 *  NA
 */
#define DMAC_CH1_LLI_RD_SLV_ERR_INTSTAT    (BIT(11))
#define DMAC_CH1_LLI_RD_SLV_ERR_INTSTAT_M  (DMAC_CH1_LLI_RD_SLV_ERR_INTSTAT_V << DMAC_CH1_LLI_RD_SLV_ERR_INTSTAT_S)
#define DMAC_CH1_LLI_RD_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_LLI_RD_SLV_ERR_INTSTAT_S  11
/** DMAC_CH1_LLI_WR_SLV_ERR_INTSTAT : RO; bitpos: [12]; default: 0;
 *  NA
 */
#define DMAC_CH1_LLI_WR_SLV_ERR_INTSTAT    (BIT(12))
#define DMAC_CH1_LLI_WR_SLV_ERR_INTSTAT_M  (DMAC_CH1_LLI_WR_SLV_ERR_INTSTAT_V << DMAC_CH1_LLI_WR_SLV_ERR_INTSTAT_S)
#define DMAC_CH1_LLI_WR_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_LLI_WR_SLV_ERR_INTSTAT_S  12
/** DMAC_CH1_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT : RO; bitpos: [13]; default: 0;
 *  NA
 */
#define DMAC_CH1_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT    (BIT(13))
#define DMAC_CH1_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_M  (DMAC_CH1_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V << DMAC_CH1_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S)
#define DMAC_CH1_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S  13
/** DMAC_CH1_SLVIF_MULTIBLKTYPE_ERR_INTSTAT : RO; bitpos: [14]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_MULTIBLKTYPE_ERR_INTSTAT    (BIT(14))
#define DMAC_CH1_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V << DMAC_CH1_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S  14
/** DMAC_CH1_SLVIF_DEC_ERR_INTSTAT : RO; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_DEC_ERR_INTSTAT    (BIT(16))
#define DMAC_CH1_SLVIF_DEC_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_DEC_ERR_INTSTAT_V << DMAC_CH1_SLVIF_DEC_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_DEC_ERR_INTSTAT_S  16
/** DMAC_CH1_SLVIF_WR2RO_ERR_INTSTAT : RO; bitpos: [17]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_WR2RO_ERR_INTSTAT    (BIT(17))
#define DMAC_CH1_SLVIF_WR2RO_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_WR2RO_ERR_INTSTAT_V << DMAC_CH1_SLVIF_WR2RO_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_WR2RO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_WR2RO_ERR_INTSTAT_S  17
/** DMAC_CH1_SLVIF_RD2RWO_ERR_INTSTAT : RO; bitpos: [18]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_RD2RWO_ERR_INTSTAT    (BIT(18))
#define DMAC_CH1_SLVIF_RD2RWO_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_RD2RWO_ERR_INTSTAT_V << DMAC_CH1_SLVIF_RD2RWO_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_RD2RWO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_RD2RWO_ERR_INTSTAT_S  18
/** DMAC_CH1_SLVIF_WRONCHEN_ERR_INTSTAT : RO; bitpos: [19]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_WRONCHEN_ERR_INTSTAT    (BIT(19))
#define DMAC_CH1_SLVIF_WRONCHEN_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_WRONCHEN_ERR_INTSTAT_V << DMAC_CH1_SLVIF_WRONCHEN_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_WRONCHEN_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_WRONCHEN_ERR_INTSTAT_S  19
/** DMAC_CH1_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT : RO; bitpos: [20]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT    (BIT(20))
#define DMAC_CH1_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V << DMAC_CH1_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S  20
/** DMAC_CH1_SLVIF_WRONHOLD_ERR_INTSTAT : RO; bitpos: [21]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_WRONHOLD_ERR_INTSTAT    (BIT(21))
#define DMAC_CH1_SLVIF_WRONHOLD_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_WRONHOLD_ERR_INTSTAT_V << DMAC_CH1_SLVIF_WRONHOLD_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_WRONHOLD_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_WRONHOLD_ERR_INTSTAT_S  21
/** DMAC_CH1_SLVIF_WRPARITY_ERR_INTSTAT : RO; bitpos: [25]; default: 0;
 *  NA
 */
#define DMAC_CH1_SLVIF_WRPARITY_ERR_INTSTAT    (BIT(25))
#define DMAC_CH1_SLVIF_WRPARITY_ERR_INTSTAT_M  (DMAC_CH1_SLVIF_WRPARITY_ERR_INTSTAT_V << DMAC_CH1_SLVIF_WRPARITY_ERR_INTSTAT_S)
#define DMAC_CH1_SLVIF_WRPARITY_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH1_SLVIF_WRPARITY_ERR_INTSTAT_S  25
/** DMAC_CH1_CH_LOCK_CLEARED_INTSTAT : RO; bitpos: [27]; default: 0;
 *  NA
 */
#define DMAC_CH1_CH_LOCK_CLEARED_INTSTAT    (BIT(27))
#define DMAC_CH1_CH_LOCK_CLEARED_INTSTAT_M  (DMAC_CH1_CH_LOCK_CLEARED_INTSTAT_V << DMAC_CH1_CH_LOCK_CLEARED_INTSTAT_S)
#define DMAC_CH1_CH_LOCK_CLEARED_INTSTAT_V  0x00000001U
#define DMAC_CH1_CH_LOCK_CLEARED_INTSTAT_S  27
/** DMAC_CH1_CH_SRC_SUSPENDED_INTSTAT : RO; bitpos: [28]; default: 0;
 *  NA
 */
#define DMAC_CH1_CH_SRC_SUSPENDED_INTSTAT    (BIT(28))
#define DMAC_CH1_CH_SRC_SUSPENDED_INTSTAT_M  (DMAC_CH1_CH_SRC_SUSPENDED_INTSTAT_V << DMAC_CH1_CH_SRC_SUSPENDED_INTSTAT_S)
#define DMAC_CH1_CH_SRC_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH1_CH_SRC_SUSPENDED_INTSTAT_S  28
/** DMAC_CH1_CH_SUSPENDED_INTSTAT : RO; bitpos: [29]; default: 0;
 *  NA
 */
#define DMAC_CH1_CH_SUSPENDED_INTSTAT    (BIT(29))
#define DMAC_CH1_CH_SUSPENDED_INTSTAT_M  (DMAC_CH1_CH_SUSPENDED_INTSTAT_V << DMAC_CH1_CH_SUSPENDED_INTSTAT_S)
#define DMAC_CH1_CH_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH1_CH_SUSPENDED_INTSTAT_S  29
/** DMAC_CH1_CH_DISABLED_INTSTAT : RO; bitpos: [30]; default: 0;
 *  NA
 */
#define DMAC_CH1_CH_DISABLED_INTSTAT    (BIT(30))
#define DMAC_CH1_CH_DISABLED_INTSTAT_M  (DMAC_CH1_CH_DISABLED_INTSTAT_V << DMAC_CH1_CH_DISABLED_INTSTAT_S)
#define DMAC_CH1_CH_DISABLED_INTSTAT_V  0x00000001U
#define DMAC_CH1_CH_DISABLED_INTSTAT_S  30
/** DMAC_CH1_CH_ABORTED_INTSTAT : RO; bitpos: [31]; default: 0;
 *  NA
 */
#define DMAC_CH1_CH_ABORTED_INTSTAT    (BIT(31))
#define DMAC_CH1_CH_ABORTED_INTSTAT_M  (DMAC_CH1_CH_ABORTED_INTSTAT_V << DMAC_CH1_CH_ABORTED_INTSTAT_S)
#define DMAC_CH1_CH_ABORTED_INTSTAT_V  0x00000001U
#define DMAC_CH1_CH_ABORTED_INTSTAT_S  31

