espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH2_CTL0_REG register
 *  NA
 */
#define DMAC_CH2_CTL0_REG (DR_REG_DMAC_BASE + 0x218)
/** DMAC_CH2_SMS : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH2_SMS    (BIT(0))
#define DMAC_CH2_SMS_M  (DMAC_CH2_SMS_V << DMAC_CH2_SMS_S)
#define DMAC_CH2_SMS_V  0x00000001U
#define DMAC_CH2_SMS_S  0
/** DMAC_CH2_DMS : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH2_DMS    (BIT(2))
#define DMAC_CH2_DMS_M  (DMAC_CH2_DMS_V << DMAC_CH2_DMS_S)
#define DMAC_CH2_DMS_V  0x00000001U
#define DMAC_CH2_DMS_S  2
/** DMAC_CH2_SINC : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH2_SINC    (BIT(4))
#define DMAC_CH2_SINC_M  (DMAC_CH2_SINC_V << DMAC_CH2_SINC_S)
#define DMAC_CH2_SINC_V  0x00000001U
#define DMAC_CH2_SINC_S  4
/** DMAC_CH2_DINC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH2_DINC    (BIT(6))
#define DMAC_CH2_DINC_M  (DMAC_CH2_DINC_V << DMAC_CH2_DINC_S)
#define DMAC_CH2_DINC_V  0x00000001U
#define DMAC_CH2_DINC_S  6
/** DMAC_CH2_SRC_TR_WIDTH : R/W; bitpos: [10:8]; default: 2;
 *  NA
 */
#define DMAC_CH2_SRC_TR_WIDTH    0x00000007U
#define DMAC_CH2_SRC_TR_WIDTH_M  (DMAC_CH2_SRC_TR_WIDTH_V << DMAC_CH2_SRC_TR_WIDTH_S)
#define DMAC_CH2_SRC_TR_WIDTH_V  0x00000007U
#define DMAC_CH2_SRC_TR_WIDTH_S  8
/** DMAC_CH2_DST_TR_WIDTH : R/W; bitpos: [13:11]; default: 2;
 *  NA
 */
#define DMAC_CH2_DST_TR_WIDTH    0x00000007U
#define DMAC_CH2_DST_TR_WIDTH_M  (DMAC_CH2_DST_TR_WIDTH_V << DMAC_CH2_DST_TR_WIDTH_S)
#define DMAC_CH2_DST_TR_WIDTH_V  0x00000007U
#define DMAC_CH2_DST_TR_WIDTH_S  11
/** DMAC_CH2_SRC_MSIZE : R/W; bitpos: [17:14]; default: 0;
 *  NA
 */
#define DMAC_CH2_SRC_MSIZE    0x0000000FU
#define DMAC_CH2_SRC_MSIZE_M  (DMAC_CH2_SRC_MSIZE_V << DMAC_CH2_SRC_MSIZE_S)
#define DMAC_CH2_SRC_MSIZE_V  0x0000000FU
#define DMAC_CH2_SRC_MSIZE_S  14
/** DMAC_CH2_DST_MSIZE : R/W; bitpos: [21:18]; default: 0;
 *  NA
 */
#define DMAC_CH2_DST_MSIZE    0x0000000FU
#define DMAC_CH2_DST_MSIZE_M  (DMAC_CH2_DST_MSIZE_V << DMAC_CH2_DST_MSIZE_S)
#define DMAC_CH2_DST_MSIZE_V  0x0000000FU
#define DMAC_CH2_DST_MSIZE_S  18
/** DMAC_CH2_AR_CACHE : R/W; bitpos: [25:22]; default: 0;
 *  NA
 */
#define DMAC_CH2_AR_CACHE    0x0000000FU
#define DMAC_CH2_AR_CACHE_M  (DMAC_CH2_AR_CACHE_V << DMAC_CH2_AR_CACHE_S)
#define DMAC_CH2_AR_CACHE_V  0x0000000FU
#define DMAC_CH2_AR_CACHE_S  22
/** DMAC_CH2_AW_CACHE : R/W; bitpos: [29:26]; default: 0;
 *  NA
 */
#define DMAC_CH2_AW_CACHE    0x0000000FU
#define DMAC_CH2_AW_CACHE_M  (DMAC_CH2_AW_CACHE_V << DMAC_CH2_AW_CACHE_S)
#define DMAC_CH2_AW_CACHE_V  0x0000000FU
#define DMAC_CH2_AW_CACHE_S  26
/** DMAC_CH2_NONPOSTED_LASTWRITE_EN : R/W; bitpos: [30]; default: 0;
 *  NA
 */
#define DMAC_CH2_NONPOSTED_LASTWRITE_EN    (BIT(30))
#define DMAC_CH2_NONPOSTED_LASTWRITE_EN_M  (DMAC_CH2_NONPOSTED_LASTWRITE_EN_V << DMAC_CH2_NONPOSTED_LASTWRITE_EN_S)
#define DMAC_CH2_NONPOSTED_LASTWRITE_EN_V  0x00000001U
#define DMAC_CH2_NONPOSTED_LASTWRITE_EN_S  30

/** DMAC_CH2_CTL1_REG register
 *  NA
 */
#define DMAC_CH2_CTL1_REG (DR_REG_DMAC_BASE + 0x21c)
/** DMAC_CH2_AR_PROT : R/W; bitpos: [2:0]; default: 0;
 *  NA
 */
#define DMAC_CH2_AR_PROT    0x00000007U
#define DMAC_CH2_AR_PROT_M  (DMAC_CH2_AR_PROT_V << DMAC_CH2_AR_PROT_S)
#define DMAC_CH2_AR_PROT_V  0x00000007U
#define DMAC_CH2_AR_PROT_S  0
/** DMAC_CH2_AW_PROT : R/W; bitpos: [5:3]; default: 0;
 *  NA
 */
#define DMAC_CH2_AW_PROT    0x00000007U
#define DMAC_CH2_AW_PROT_M  (DMAC_CH2_AW_PROT_V << DMAC_CH2_AW_PROT_S)
#define DMAC_CH2_AW_PROT_V  0x00000007U
#define DMAC_CH2_AW_PROT_S  3
/** DMAC_CH2_ARLEN_EN : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH2_ARLEN_EN    (BIT(6))
#define DMAC_CH2_ARLEN_EN_M  (DMAC_CH2_ARLEN_EN_V << DMAC_CH2_ARLEN_EN_S)
#define DMAC_CH2_ARLEN_EN_V  0x00000001U
#define DMAC_CH2_ARLEN_EN_S  6
/** DMAC_CH2_ARLEN : R/W; bitpos: [14:7]; default: 0;
 *  NA
 */
#define DMAC_CH2_ARLEN    0x000000FFU
#define DMAC_CH2_ARLEN_M  (DMAC_CH2_ARLEN_V << DMAC_CH2_ARLEN_S)
#define DMAC_CH2_ARLEN_V  0x000000FFU
#define DMAC_CH2_ARLEN_S  7
/** DMAC_CH2_AWLEN_EN : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define DMAC_CH2_AWLEN_EN    (BIT(15))
#define DMAC_CH2_AWLEN_EN_M  (DMAC_CH2_AWLEN_EN_V << DMAC_CH2_AWLEN_EN_S)
#define DMAC_CH2_AWLEN_EN_V  0x00000001U
#define DMAC_CH2_AWLEN_EN_S  15
/** DMAC_CH2_AWLEN : R/W; bitpos: [23:16]; default: 0;
 *  NA
 */
#define DMAC_CH2_AWLEN    0x000000FFU
#define DMAC_CH2_AWLEN_M  (DMAC_CH2_AWLEN_V << DMAC_CH2_AWLEN_S)
#define DMAC_CH2_AWLEN_V  0x000000FFU
#define DMAC_CH2_AWLEN_S  16
/** DMAC_CH2_SRC_STAT_EN : R/W; bitpos: [24]; default: 0;
 *  NA
 */
#define DMAC_CH2_SRC_STAT_EN    (BIT(24))
#define DMAC_CH2_SRC_STAT_EN_M  (DMAC_CH2_SRC_STAT_EN_V << DMAC_CH2_SRC_STAT_EN_S)
#define DMAC_CH2_SRC_STAT_EN_V  0x00000001U
#define DMAC_CH2_SRC_STAT_EN_S  24
/** DMAC_CH2_DST_STAT_EN : R/W; bitpos: [25]; default: 0;
 *  NA
 */
#define DMAC_CH2_DST_STAT_EN    (BIT(25))
#define DMAC_CH2_DST_STAT_EN_M  (DMAC_CH2_DST_STAT_EN_V << DMAC_CH2_DST_STAT_EN_S)
#define DMAC_CH2_DST_STAT_EN_V  0x00000001U
#define DMAC_CH2_DST_STAT_EN_S  25
/** DMAC_CH2_IOC_BLKTFR : R/W; bitpos: [26]; default: 0;
 *  NA
 */
#define DMAC_CH2_IOC_BLKTFR    (BIT(26))
#define DMAC_CH2_IOC_BLKTFR_M  (DMAC_CH2_IOC_BLKTFR_V << DMAC_CH2_IOC_BLKTFR_S)
#define DMAC_CH2_IOC_BLKTFR_V  0x00000001U
#define DMAC_CH2_IOC_BLKTFR_S  26
/** DMAC_CH2_SHADOWREG_OR_LLI_LAST : R/W; bitpos: [30]; default: 0;
 *  NA
 */
#define DMAC_CH2_SHADOWREG_OR_LLI_LAST    (BIT(30))
#define DMAC_CH2_SHADOWREG_OR_LLI_LAST_M  (DMAC_CH2_SHADOWREG_OR_LLI_LAST_V << DMAC_CH2_SHADOWREG_OR_LLI_LAST_S)
#define DMAC_CH2_SHADOWREG_OR_LLI_LAST_V  0x00000001U
#define DMAC_CH2_SHADOWREG_OR_LLI_LAST_S  30
/** DMAC_CH2_SHADOWREG_OR_LLI_VALID : R/W; bitpos: [31]; default: 0;
 *  NA
 */
#define DMAC_CH2_SHADOWREG_OR_LLI_VALID    (BIT(31))
#define DMAC_CH2_SHADOWREG_OR_LLI_VALID_M  (DMAC_CH2_SHADOWREG_OR_LLI_VALID_V << DMAC_CH2_SHADOWREG_OR_LLI_VALID_S)
#define DMAC_CH2_SHADOWREG_OR_LLI_VALID_V  0x00000001U
#define DMAC_CH2_SHADOWREG_OR_LLI_VALID_S  31

/** DMAC_CH2_CFG0_REG register
 *  NA
 */
#define DMAC_CH2_CFG0_REG (DR_REG_DMAC_BASE + 0x220)
/** DMAC_CH2_SRC_MULTBLK_TYPE : R/W; bitpos: [1:0]; default: 0;
 *  NA
 */
#define DMAC_CH2_SRC_MULTBLK_TYPE    0x00000003U
#define DMAC_CH2_SRC_MULTBLK_TYPE_M  (DMAC_CH2_SRC_MULTBLK_TYPE_V << DMAC_CH2_SRC_MULTBLK_TYPE_S)
#define DMAC_CH2_SRC_MULTBLK_TYPE_V  0x00000003U
#define DMAC_CH2_SRC_MULTBLK_TYPE_S  0
/** DMAC_CH2_DST_MULTBLK_TYPE : R/W; bitpos: [3:2]; default: 0;
 *  NA
 */
#define DMAC_CH2_DST_MULTBLK_TYPE    0x00000003U
#define DMAC_CH2_DST_MULTBLK_TYPE_M  (DMAC_CH2_DST_MULTBLK_TYPE_V << DMAC_CH2_DST_MULTBLK_TYPE_S)
#define DMAC_CH2_DST_MULTBLK_TYPE_V  0x00000003U
#define DMAC_CH2_DST_MULTBLK_TYPE_S  2
/** DMAC_CH2_RD_UID : RO; bitpos: [21:18]; default: 0;
 *  NA
 */
#define DMAC_CH2_RD_UID    0x0000000FU
#define DMAC_CH2_RD_UID_M  (DMAC_CH2_RD_UID_V << DMAC_CH2_RD_UID_S)
#define DMAC_CH2_RD_UID_V  0x0000000FU
#define DMAC_CH2_RD_UID_S  18
/** DMAC_CH2_WR_UID : RO; bitpos: [28:25]; default: 0;
 *  NA
 */
#define DMAC_CH2_WR_UID    0x0000000FU
#define DMAC_CH2_WR_UID_M  (DMAC_CH2_WR_UID_V << DMAC_CH2_WR_UID_S)
#define DMAC_CH2_WR_UID_V  0x0000000FU
#define DMAC_CH2_WR_UID_S  25

/** DMAC_CH2_CFG1_REG register
 *  NA
 */
#define DMAC_CH2_CFG1_REG (DR_REG_DMAC_BASE + 0x224)
/** DMAC_CH2_TT_FC : R/W; bitpos: [2:0]; default: 3;
 *  NA
 */
#define DMAC_CH2_TT_FC    0x00000007U
#define DMAC_CH2_TT_FC_M  (DMAC_CH2_TT_FC_V << DMAC_CH2_TT_FC_S)
#define DMAC_CH2_TT_FC_V  0x00000007U
#define DMAC_CH2_TT_FC_S  0
/** DMAC_CH2_HS_SEL_SRC : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH2_HS_SEL_SRC    (BIT(3))
#define DMAC_CH2_HS_SEL_SRC_M  (DMAC_CH2_HS_SEL_SRC_V << DMAC_CH2_HS_SEL_SRC_S)
#define DMAC_CH2_HS_SEL_SRC_V  0x00000001U
#define DMAC_CH2_HS_SEL_SRC_S  3
/** DMAC_CH2_HS_SEL_DST : R/W; bitpos: [4]; default: 1;
 *  NA
 */
#define DMAC_CH2_HS_SEL_DST    (BIT(4))
#define DMAC_CH2_HS_SEL_DST_M  (DMAC_CH2_HS_SEL_DST_V << DMAC_CH2_HS_SEL_DST_S)
#define DMAC_CH2_HS_SEL_DST_V  0x00000001U
#define DMAC_CH2_HS_SEL_DST_S  4
/** DMAC_CH2_SRC_HWHS_POL : RO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH2_SRC_HWHS_POL    (BIT(5))
#define DMAC_CH2_SRC_HWHS_POL_M  (DMAC_CH2_SRC_HWHS_POL_V << DMAC_CH2_SRC_HWHS_POL_S)
#define DMAC_CH2_SRC_HWHS_POL_V  0x00000001U
#define DMAC_CH2_SRC_HWHS_POL_S  5
/** DMAC_CH2_DST_HWHS_POL : RO; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH2_DST_HWHS_POL    (BIT(6))
#define DMAC_CH2_DST_HWHS_POL_M  (DMAC_CH2_DST_HWHS_POL_V << DMAC_CH2_DST_HWHS_POL_S)
#define DMAC_CH2_DST_HWHS_POL_V  0x00000001U
#define DMAC_CH2_DST_HWHS_POL_S  6
/** DMAC_CH2_SRC_PER : R/W; bitpos: [8:7]; default: 0;
 *  NA
 */
#define DMAC_CH2_SRC_PER    0x00000003U
#define DMAC_CH2_SRC_PER_M  (DMAC_CH2_SRC_PER_V << DMAC_CH2_SRC_PER_S)
#define DMAC_CH2_SRC_PER_V  0x00000003U
#define DMAC_CH2_SRC_PER_S  7
/** DMAC_CH2_DST_PER : R/W; bitpos: [13:12]; default: 0;
 *  NA
 */
#define DMAC_CH2_DST_PER    0x00000003U
#define DMAC_CH2_DST_PER_M  (DMAC_CH2_DST_PER_V << DMAC_CH2_DST_PER_S)
#define DMAC_CH2_DST_PER_V  0x00000003U
#define DMAC_CH2_DST_PER_S  12
/** DMAC_CH2_CH_PRIOR : R/W; bitpos: [19:17]; default: 2;
 *  NA
 */
#define DMAC_CH2_CH_PRIOR    0x00000007U
#define DMAC_CH2_CH_PRIOR_M  (DMAC_CH2_CH_PRIOR_V << DMAC_CH2_CH_PRIOR_S)
#define DMAC_CH2_CH_PRIOR_V  0x00000007U
#define DMAC_CH2_CH_PRIOR_S  17
/** DMAC_CH2_LOCK_CH : RO; bitpos: [20]; default: 0;
 *  NA
 */
#define DMAC_CH2_LOCK_CH    (BIT(20))
#define DMAC_CH2_LOCK_CH_M  (DMAC_CH2_LOCK_CH_V << DMAC_CH2_LOCK_CH_S)
#define DMAC_CH2_LOCK_CH_V  0x00000001U
#define DMAC_CH2_LOCK_CH_S  20
/** DMAC_CH2_LOCK_CH_L : RO; bitpos: [22:21]; default: 0;
 *  NA
 */
#define DMAC_CH2_LOCK_CH_L    0x00000003U
#define DMAC_CH2_LOCK_CH_L_M  (DMAC_CH2_LOCK_CH_L_V << DMAC_CH2_LOCK_CH_L_S)
#define DMAC_CH2_LOCK_CH_L_V  0x00000003U
#define DMAC_CH2_LOCK_CH_L_S  21
/** DMAC_CH2_SRC_OSR_LMT : R/W; bitpos: [26:23]; default: 0;
 *  NA
 */
#define DMAC_CH2_SRC_OSR_LMT    0x0000000FU
#define DMAC_CH2_SRC_OSR_LMT_M  (DMAC_CH2_SRC_OSR_LMT_V << DMAC_CH2_SRC_OSR_LMT_S)
#define DMAC_CH2_SRC_OSR_LMT_V  0x0000000FU
#define DMAC_CH2_SRC_OSR_LMT_S  23
/** DMAC_CH2_DST_OSR_LMT : R/W; bitpos: [30:27]; default: 0;
 *  NA
 */
#define DMAC_CH2_DST_OSR_LMT    0x0000000FU
#define DMAC_CH2_DST_OSR_LMT_M  (DMAC_CH2_DST_OSR_LMT_V << DMAC_CH2_DST_OSR_LMT_S)
#define DMAC_CH2_DST_OSR_LMT_V  0x0000000FU
#define DMAC_CH2_DST_OSR_LMT_S  27

/** DMAC_CH2_LLP0_REG register
 *  NA
 */
#define DMAC_CH2_LLP0_REG (DR_REG_DMAC_BASE + 0x228)
/** DMAC_CH2_LMS : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH2_LMS    (BIT(0))
#define DMAC_CH2_LMS_M  (DMAC_CH2_LMS_V << DMAC_CH2_LMS_S)
#define DMAC_CH2_LMS_V  0x00000001U
#define DMAC_CH2_LMS_S  0
/** DMAC_CH2_LOC0 : R/W; bitpos: [31:6]; default: 0;
 *  NA
 */
#define DMAC_CH2_LOC0    0x03FFFFFFU
#define DMAC_CH2_LOC0_M  (DMAC_CH2_LOC0_V << DMAC_CH2_LOC0_S)
#define DMAC_CH2_LOC0_V  0x03FFFFFFU
#define DMAC_CH2_LOC0_S  6

/** DMAC_CH2_LLP1_REG register
 *  NA
 */
#define DMAC_CH2_LLP1_REG (DR_REG_DMAC_BASE + 0x22c)
/** DMAC_CH2_LOC1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH2_LOC1    0xFFFFFFFFU
#define DMAC_CH2_LOC1_M  (DMAC_CH2_LOC1_V << DMAC_CH2_LOC1_S)
#define DMAC_CH2_LOC1_V  0xFFFFFFFFU
#define DMAC_CH2_LOC1_S  0

