espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH2_INTSIGNAL_ENABLE0_REG register
 *  NA
 */
#define DMAC_CH2_INTSIGNAL_ENABLE0_REG (DR_REG_DMAC_BASE + 0x290)
/** DMAC_CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL    (BIT(0))
#define DMAC_CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL_M  (DMAC_CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL_V << DMAC_CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL_S  0
/** DMAC_CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL : R/W; bitpos: [1]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL    (BIT(1))
#define DMAC_CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL_M  (DMAC_CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL_V << DMAC_CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL_S  1
/** DMAC_CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL    (BIT(3))
#define DMAC_CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL_M  (DMAC_CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL_V << DMAC_CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL_S  3
/** DMAC_CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL : R/W; bitpos: [4]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL    (BIT(4))
#define DMAC_CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL_M  (DMAC_CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL_V << DMAC_CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL_S  4
/** DMAC_CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL : R/W; bitpos: [5]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL    (BIT(5))
#define DMAC_CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL_S  5
/** DMAC_CH2_ENABLE_DST_DEC_ERR_INTSIGNAL : R/W; bitpos: [6]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_DST_DEC_ERR_INTSIGNAL    (BIT(6))
#define DMAC_CH2_ENABLE_DST_DEC_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_DST_DEC_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_DST_DEC_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_DST_DEC_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_DST_DEC_ERR_INTSIGNAL_S  6
/** DMAC_CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL : R/W; bitpos: [7]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL    (BIT(7))
#define DMAC_CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL_S  7
/** DMAC_CH2_ENABLE_DST_SLV_ERR_INTSIGNAL : R/W; bitpos: [8]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_DST_SLV_ERR_INTSIGNAL    (BIT(8))
#define DMAC_CH2_ENABLE_DST_SLV_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_DST_SLV_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_DST_SLV_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_DST_SLV_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_DST_SLV_ERR_INTSIGNAL_S  8
/** DMAC_CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL : R/W; bitpos: [9]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL    (BIT(9))
#define DMAC_CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL_S  9
/** DMAC_CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL : R/W; bitpos: [10]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL    (BIT(10))
#define DMAC_CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL_S  10
/** DMAC_CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL : R/W; bitpos: [11]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL    (BIT(11))
#define DMAC_CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL_S  11
/** DMAC_CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL : R/W; bitpos: [12]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL    (BIT(12))
#define DMAC_CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL_S  12
/** DMAC_CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL : R/W; bitpos: [13];
 *  default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL    (BIT(13))
#define DMAC_CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL_S  13
/** DMAC_CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL : R/W; bitpos: [14]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL    (BIT(14))
#define DMAC_CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL_S  14
/** DMAC_CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL : R/W; bitpos: [16]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL    (BIT(16))
#define DMAC_CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL_S  16
/** DMAC_CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL : R/W; bitpos: [17]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL    (BIT(17))
#define DMAC_CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL_S  17
/** DMAC_CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL : R/W; bitpos: [18]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL    (BIT(18))
#define DMAC_CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL_S  18
/** DMAC_CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL : R/W; bitpos: [19]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL    (BIT(19))
#define DMAC_CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL_S  19
/** DMAC_CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL : R/W; bitpos: [20];
 *  default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL    (BIT(20))
#define DMAC_CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL_S  20
/** DMAC_CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL : R/W; bitpos: [21]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL    (BIT(21))
#define DMAC_CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL_S  21
/** DMAC_CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL : RO; bitpos: [25]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL    (BIT(25))
#define DMAC_CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL_V << DMAC_CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL_S  25
/** DMAC_CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL : R/W; bitpos: [27]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL    (BIT(27))
#define DMAC_CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL_M  (DMAC_CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL_V << DMAC_CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL_S  27
/** DMAC_CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL : R/W; bitpos: [28]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL    (BIT(28))
#define DMAC_CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL_M  (DMAC_CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL_V << DMAC_CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL_S  28
/** DMAC_CH2_ENABLE_CH_SUSPENDED_INTSIGNAL : R/W; bitpos: [29]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_CH_SUSPENDED_INTSIGNAL    (BIT(29))
#define DMAC_CH2_ENABLE_CH_SUSPENDED_INTSIGNAL_M  (DMAC_CH2_ENABLE_CH_SUSPENDED_INTSIGNAL_V << DMAC_CH2_ENABLE_CH_SUSPENDED_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_CH_SUSPENDED_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_CH_SUSPENDED_INTSIGNAL_S  29
/** DMAC_CH2_ENABLE_CH_DISABLED_INTSIGNAL : R/W; bitpos: [30]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_CH_DISABLED_INTSIGNAL    (BIT(30))
#define DMAC_CH2_ENABLE_CH_DISABLED_INTSIGNAL_M  (DMAC_CH2_ENABLE_CH_DISABLED_INTSIGNAL_V << DMAC_CH2_ENABLE_CH_DISABLED_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_CH_DISABLED_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_CH_DISABLED_INTSIGNAL_S  30
/** DMAC_CH2_ENABLE_CH_ABORTED_INTSIGNAL : R/W; bitpos: [31]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_CH_ABORTED_INTSIGNAL    (BIT(31))
#define DMAC_CH2_ENABLE_CH_ABORTED_INTSIGNAL_M  (DMAC_CH2_ENABLE_CH_ABORTED_INTSIGNAL_V << DMAC_CH2_ENABLE_CH_ABORTED_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_CH_ABORTED_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_CH_ABORTED_INTSIGNAL_S  31

/** DMAC_CH2_INTSIGNAL_ENABLE1_REG register
 *  NA
 */
#define DMAC_CH2_INTSIGNAL_ENABLE1_REG (DR_REG_DMAC_BASE + 0x294)
/** DMAC_CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL : RO; bitpos: [0]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL    (BIT(0))
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL_V << DMAC_CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL_S  0
/** DMAC_CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL : RO; bitpos: [1]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL    (BIT(1))
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL_V << DMAC_CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL_S  1
/** DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL : RO; bitpos: [2]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL    (BIT(2))
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL_V << DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL_S  2
/** DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL : RO; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL    (BIT(3))
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL_M  (DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL_V << DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL_S)
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL_V  0x00000001U
#define DMAC_CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL_S  3

/** DMAC_CH2_INTCLEAR0_REG register
 *  NA
 */
#define DMAC_CH2_INTCLEAR0_REG (DR_REG_DMAC_BASE + 0x298)
/** DMAC_CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT : WO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT    (BIT(0))
#define DMAC_CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT_M  (DMAC_CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT_V << DMAC_CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT_S)
#define DMAC_CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT_S  0
/** DMAC_CH2_CLEAR_DMA_TFR_DONE_INTSTAT : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_DMA_TFR_DONE_INTSTAT    (BIT(1))
#define DMAC_CH2_CLEAR_DMA_TFR_DONE_INTSTAT_M  (DMAC_CH2_CLEAR_DMA_TFR_DONE_INTSTAT_V << DMAC_CH2_CLEAR_DMA_TFR_DONE_INTSTAT_S)
#define DMAC_CH2_CLEAR_DMA_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_DMA_TFR_DONE_INTSTAT_S  1
/** DMAC_CH2_CLEAR_SRC_TRANSCOMP_INTSTAT : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SRC_TRANSCOMP_INTSTAT    (BIT(3))
#define DMAC_CH2_CLEAR_SRC_TRANSCOMP_INTSTAT_M  (DMAC_CH2_CLEAR_SRC_TRANSCOMP_INTSTAT_V << DMAC_CH2_CLEAR_SRC_TRANSCOMP_INTSTAT_S)
#define DMAC_CH2_CLEAR_SRC_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SRC_TRANSCOMP_INTSTAT_S  3
/** DMAC_CH2_CLEAR_DST_TRANSCOMP_INTSTAT : WO; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_DST_TRANSCOMP_INTSTAT    (BIT(4))
#define DMAC_CH2_CLEAR_DST_TRANSCOMP_INTSTAT_M  (DMAC_CH2_CLEAR_DST_TRANSCOMP_INTSTAT_V << DMAC_CH2_CLEAR_DST_TRANSCOMP_INTSTAT_S)
#define DMAC_CH2_CLEAR_DST_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_DST_TRANSCOMP_INTSTAT_S  4
/** DMAC_CH2_CLEAR_SRC_DEC_ERR_INTSTAT : WO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SRC_DEC_ERR_INTSTAT    (BIT(5))
#define DMAC_CH2_CLEAR_SRC_DEC_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SRC_DEC_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SRC_DEC_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SRC_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SRC_DEC_ERR_INTSTAT_S  5
/** DMAC_CH2_CLEAR_DST_DEC_ERR_INTSTAT : WO; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_DST_DEC_ERR_INTSTAT    (BIT(6))
#define DMAC_CH2_CLEAR_DST_DEC_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_DST_DEC_ERR_INTSTAT_V << DMAC_CH2_CLEAR_DST_DEC_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_DST_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_DST_DEC_ERR_INTSTAT_S  6
/** DMAC_CH2_CLEAR_SRC_SLV_ERR_INTSTAT : WO; bitpos: [7]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SRC_SLV_ERR_INTSTAT    (BIT(7))
#define DMAC_CH2_CLEAR_SRC_SLV_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SRC_SLV_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SRC_SLV_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SRC_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SRC_SLV_ERR_INTSTAT_S  7
/** DMAC_CH2_CLEAR_DST_SLV_ERR_INTSTAT : WO; bitpos: [8]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_DST_SLV_ERR_INTSTAT    (BIT(8))
#define DMAC_CH2_CLEAR_DST_SLV_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_DST_SLV_ERR_INTSTAT_V << DMAC_CH2_CLEAR_DST_SLV_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_DST_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_DST_SLV_ERR_INTSTAT_S  8
/** DMAC_CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT : WO; bitpos: [9]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT    (BIT(9))
#define DMAC_CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT_V << DMAC_CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT_S  9
/** DMAC_CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT : WO; bitpos: [10]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT    (BIT(10))
#define DMAC_CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT_V << DMAC_CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT_S  10
/** DMAC_CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT : WO; bitpos: [11]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT    (BIT(11))
#define DMAC_CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT_V << DMAC_CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT_S  11
/** DMAC_CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT : WO; bitpos: [12]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT    (BIT(12))
#define DMAC_CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT_V << DMAC_CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT_S  12
/** DMAC_CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT : WO; bitpos: [13]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT    (BIT(13))
#define DMAC_CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S  13
/** DMAC_CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT : WO; bitpos: [14]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT    (BIT(14))
#define DMAC_CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S  14
/** DMAC_CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT : WO; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT    (BIT(16))
#define DMAC_CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT_S  16
/** DMAC_CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT : WO; bitpos: [17]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT    (BIT(17))
#define DMAC_CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT_S  17
/** DMAC_CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT : WO; bitpos: [18]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT    (BIT(18))
#define DMAC_CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT_S  18
/** DMAC_CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT : WO; bitpos: [19]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT    (BIT(19))
#define DMAC_CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT_S  19
/** DMAC_CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT : WO; bitpos: [20]; default:
 *  0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT    (BIT(20))
#define DMAC_CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S  20
/** DMAC_CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT : WO; bitpos: [21]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT    (BIT(21))
#define DMAC_CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT_S  21
/** DMAC_CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT : WO; bitpos: [25]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT    (BIT(25))
#define DMAC_CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT_M  (DMAC_CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT_V << DMAC_CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT_S)
#define DMAC_CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT_S  25
/** DMAC_CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT : WO; bitpos: [27]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT    (BIT(27))
#define DMAC_CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT_M  (DMAC_CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT_V << DMAC_CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT_S)
#define DMAC_CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT_S  27
/** DMAC_CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT : WO; bitpos: [28]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT    (BIT(28))
#define DMAC_CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT_M  (DMAC_CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT_V << DMAC_CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT_S)
#define DMAC_CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT_S  28
/** DMAC_CH2_CLEAR_CH_SUSPENDED_INTSTAT : WO; bitpos: [29]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_CH_SUSPENDED_INTSTAT    (BIT(29))
#define DMAC_CH2_CLEAR_CH_SUSPENDED_INTSTAT_M  (DMAC_CH2_CLEAR_CH_SUSPENDED_INTSTAT_V << DMAC_CH2_CLEAR_CH_SUSPENDED_INTSTAT_S)
#define DMAC_CH2_CLEAR_CH_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_CH_SUSPENDED_INTSTAT_S  29
/** DMAC_CH2_CLEAR_CH_DISABLED_INTSTAT : WO; bitpos: [30]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_CH_DISABLED_INTSTAT    (BIT(30))
#define DMAC_CH2_CLEAR_CH_DISABLED_INTSTAT_M  (DMAC_CH2_CLEAR_CH_DISABLED_INTSTAT_V << DMAC_CH2_CLEAR_CH_DISABLED_INTSTAT_S)
#define DMAC_CH2_CLEAR_CH_DISABLED_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_CH_DISABLED_INTSTAT_S  30
/** DMAC_CH2_CLEAR_CH_ABORTED_INTSTAT : WO; bitpos: [31]; default: 0;
 *  NA
 */
#define DMAC_CH2_CLEAR_CH_ABORTED_INTSTAT    (BIT(31))
#define DMAC_CH2_CLEAR_CH_ABORTED_INTSTAT_M  (DMAC_CH2_CLEAR_CH_ABORTED_INTSTAT_V << DMAC_CH2_CLEAR_CH_ABORTED_INTSTAT_S)
#define DMAC_CH2_CLEAR_CH_ABORTED_INTSTAT_V  0x00000001U
#define DMAC_CH2_CLEAR_CH_ABORTED_INTSTAT_S  31

