espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH3_STATUS0_REG register
 *  NA
 */
#define DMAC_CH3_STATUS0_REG (DR_REG_DMAC_BASE + 0x330)
/** DMAC_CH3_CMPLTD_BLK_TFR_SIZE : RO; bitpos: [21:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_CMPLTD_BLK_TFR_SIZE    0x003FFFFFU
#define DMAC_CH3_CMPLTD_BLK_TFR_SIZE_M  (DMAC_CH3_CMPLTD_BLK_TFR_SIZE_V << DMAC_CH3_CMPLTD_BLK_TFR_SIZE_S)
#define DMAC_CH3_CMPLTD_BLK_TFR_SIZE_V  0x003FFFFFU
#define DMAC_CH3_CMPLTD_BLK_TFR_SIZE_S  0

/** DMAC_CH3_STATUS1_REG register
 *  NA
 */
#define DMAC_CH3_STATUS1_REG (DR_REG_DMAC_BASE + 0x334)
/** DMAC_CH3_DATA_LEFT_IN_FIFO : RO; bitpos: [14:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_DATA_LEFT_IN_FIFO    0x00007FFFU
#define DMAC_CH3_DATA_LEFT_IN_FIFO_M  (DMAC_CH3_DATA_LEFT_IN_FIFO_V << DMAC_CH3_DATA_LEFT_IN_FIFO_S)
#define DMAC_CH3_DATA_LEFT_IN_FIFO_V  0x00007FFFU
#define DMAC_CH3_DATA_LEFT_IN_FIFO_S  0

/** DMAC_CH3_SWHSSRC0_REG register
 *  NA
 */
#define DMAC_CH3_SWHSSRC0_REG (DR_REG_DMAC_BASE + 0x338)
/** DMAC_CH3_SWHS_REQ_SRC : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_REQ_SRC    (BIT(0))
#define DMAC_CH3_SWHS_REQ_SRC_M  (DMAC_CH3_SWHS_REQ_SRC_V << DMAC_CH3_SWHS_REQ_SRC_S)
#define DMAC_CH3_SWHS_REQ_SRC_V  0x00000001U
#define DMAC_CH3_SWHS_REQ_SRC_S  0
/** DMAC_CH3_SWHS_REQ_SRC_WE : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_REQ_SRC_WE    (BIT(1))
#define DMAC_CH3_SWHS_REQ_SRC_WE_M  (DMAC_CH3_SWHS_REQ_SRC_WE_V << DMAC_CH3_SWHS_REQ_SRC_WE_S)
#define DMAC_CH3_SWHS_REQ_SRC_WE_V  0x00000001U
#define DMAC_CH3_SWHS_REQ_SRC_WE_S  1
/** DMAC_CH3_SWHS_SGLREQ_SRC : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_SGLREQ_SRC    (BIT(2))
#define DMAC_CH3_SWHS_SGLREQ_SRC_M  (DMAC_CH3_SWHS_SGLREQ_SRC_V << DMAC_CH3_SWHS_SGLREQ_SRC_S)
#define DMAC_CH3_SWHS_SGLREQ_SRC_V  0x00000001U
#define DMAC_CH3_SWHS_SGLREQ_SRC_S  2
/** DMAC_CH3_SWHS_SGLREQ_SRC_WE : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_SGLREQ_SRC_WE    (BIT(3))
#define DMAC_CH3_SWHS_SGLREQ_SRC_WE_M  (DMAC_CH3_SWHS_SGLREQ_SRC_WE_V << DMAC_CH3_SWHS_SGLREQ_SRC_WE_S)
#define DMAC_CH3_SWHS_SGLREQ_SRC_WE_V  0x00000001U
#define DMAC_CH3_SWHS_SGLREQ_SRC_WE_S  3
/** DMAC_CH3_SWHS_LST_SRC : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_LST_SRC    (BIT(4))
#define DMAC_CH3_SWHS_LST_SRC_M  (DMAC_CH3_SWHS_LST_SRC_V << DMAC_CH3_SWHS_LST_SRC_S)
#define DMAC_CH3_SWHS_LST_SRC_V  0x00000001U
#define DMAC_CH3_SWHS_LST_SRC_S  4
/** DMAC_CH3_SWHS_LST_SRC_WE : WO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_LST_SRC_WE    (BIT(5))
#define DMAC_CH3_SWHS_LST_SRC_WE_M  (DMAC_CH3_SWHS_LST_SRC_WE_V << DMAC_CH3_SWHS_LST_SRC_WE_S)
#define DMAC_CH3_SWHS_LST_SRC_WE_V  0x00000001U
#define DMAC_CH3_SWHS_LST_SRC_WE_S  5

/** DMAC_CH3_SWHSDST0_REG register
 *  NA
 */
#define DMAC_CH3_SWHSDST0_REG (DR_REG_DMAC_BASE + 0x340)
/** DMAC_CH3_SWHS_REQ_DST : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_REQ_DST    (BIT(0))
#define DMAC_CH3_SWHS_REQ_DST_M  (DMAC_CH3_SWHS_REQ_DST_V << DMAC_CH3_SWHS_REQ_DST_S)
#define DMAC_CH3_SWHS_REQ_DST_V  0x00000001U
#define DMAC_CH3_SWHS_REQ_DST_S  0
/** DMAC_CH3_SWHS_REQ_DST_WE : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_REQ_DST_WE    (BIT(1))
#define DMAC_CH3_SWHS_REQ_DST_WE_M  (DMAC_CH3_SWHS_REQ_DST_WE_V << DMAC_CH3_SWHS_REQ_DST_WE_S)
#define DMAC_CH3_SWHS_REQ_DST_WE_V  0x00000001U
#define DMAC_CH3_SWHS_REQ_DST_WE_S  1
/** DMAC_CH3_SWHS_SGLREQ_DST : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_SGLREQ_DST    (BIT(2))
#define DMAC_CH3_SWHS_SGLREQ_DST_M  (DMAC_CH3_SWHS_SGLREQ_DST_V << DMAC_CH3_SWHS_SGLREQ_DST_S)
#define DMAC_CH3_SWHS_SGLREQ_DST_V  0x00000001U
#define DMAC_CH3_SWHS_SGLREQ_DST_S  2
/** DMAC_CH3_SWHS_SGLREQ_DST_WE : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_SGLREQ_DST_WE    (BIT(3))
#define DMAC_CH3_SWHS_SGLREQ_DST_WE_M  (DMAC_CH3_SWHS_SGLREQ_DST_WE_V << DMAC_CH3_SWHS_SGLREQ_DST_WE_S)
#define DMAC_CH3_SWHS_SGLREQ_DST_WE_V  0x00000001U
#define DMAC_CH3_SWHS_SGLREQ_DST_WE_S  3
/** DMAC_CH3_SWHS_LST_DST : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_LST_DST    (BIT(4))
#define DMAC_CH3_SWHS_LST_DST_M  (DMAC_CH3_SWHS_LST_DST_V << DMAC_CH3_SWHS_LST_DST_S)
#define DMAC_CH3_SWHS_LST_DST_V  0x00000001U
#define DMAC_CH3_SWHS_LST_DST_S  4
/** DMAC_CH3_SWHS_LST_DST_WE : WO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH3_SWHS_LST_DST_WE    (BIT(5))
#define DMAC_CH3_SWHS_LST_DST_WE_M  (DMAC_CH3_SWHS_LST_DST_WE_V << DMAC_CH3_SWHS_LST_DST_WE_S)
#define DMAC_CH3_SWHS_LST_DST_WE_V  0x00000001U
#define DMAC_CH3_SWHS_LST_DST_WE_S  5

/** DMAC_CH3_BLK_TFR_RESUMEREQ0_REG register
 *  NA
 */
#define DMAC_CH3_BLK_TFR_RESUMEREQ0_REG (DR_REG_DMAC_BASE + 0x348)
/** DMAC_CH3_BLK_TFR_RESUMEREQ : WO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH3_BLK_TFR_RESUMEREQ    (BIT(0))
#define DMAC_CH3_BLK_TFR_RESUMEREQ_M  (DMAC_CH3_BLK_TFR_RESUMEREQ_V << DMAC_CH3_BLK_TFR_RESUMEREQ_S)
#define DMAC_CH3_BLK_TFR_RESUMEREQ_V  0x00000001U
#define DMAC_CH3_BLK_TFR_RESUMEREQ_S  0

/** DMAC_CH3_AXI_ID0_REG register
 *  NA
 */
#define DMAC_CH3_AXI_ID0_REG (DR_REG_DMAC_BASE + 0x350)
/** DMAC_CH3_AXI_READ_ID_SUFFIX : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH3_AXI_READ_ID_SUFFIX    (BIT(0))
#define DMAC_CH3_AXI_READ_ID_SUFFIX_M  (DMAC_CH3_AXI_READ_ID_SUFFIX_V << DMAC_CH3_AXI_READ_ID_SUFFIX_S)
#define DMAC_CH3_AXI_READ_ID_SUFFIX_V  0x00000001U
#define DMAC_CH3_AXI_READ_ID_SUFFIX_S  0
/** DMAC_CH3_AXI_WRITE_ID_SUFFIX : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_CH3_AXI_WRITE_ID_SUFFIX    (BIT(16))
#define DMAC_CH3_AXI_WRITE_ID_SUFFIX_M  (DMAC_CH3_AXI_WRITE_ID_SUFFIX_V << DMAC_CH3_AXI_WRITE_ID_SUFFIX_S)
#define DMAC_CH3_AXI_WRITE_ID_SUFFIX_V  0x00000001U
#define DMAC_CH3_AXI_WRITE_ID_SUFFIX_S  16

/** DMAC_CH3_AXI_QOS0_REG register
 *  NA
 */
#define DMAC_CH3_AXI_QOS0_REG (DR_REG_DMAC_BASE + 0x358)
/** DMAC_CH3_AXI_AWQOS : R/W; bitpos: [3:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_AXI_AWQOS    0x0000000FU
#define DMAC_CH3_AXI_AWQOS_M  (DMAC_CH3_AXI_AWQOS_V << DMAC_CH3_AXI_AWQOS_S)
#define DMAC_CH3_AXI_AWQOS_V  0x0000000FU
#define DMAC_CH3_AXI_AWQOS_S  0
/** DMAC_CH3_AXI_ARQOS : R/W; bitpos: [7:4]; default: 0;
 *  NA
 */
#define DMAC_CH3_AXI_ARQOS    0x0000000FU
#define DMAC_CH3_AXI_ARQOS_M  (DMAC_CH3_AXI_ARQOS_V << DMAC_CH3_AXI_ARQOS_S)
#define DMAC_CH3_AXI_ARQOS_V  0x0000000FU
#define DMAC_CH3_AXI_ARQOS_S  4

