espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH3_SSTAT0_REG register
 *  NA
 */
#define DMAC_CH3_SSTAT0_REG (DR_REG_DMAC_BASE + 0x360)
/** DMAC_CH3_SSTAT : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_SSTAT    0xFFFFFFFFU
#define DMAC_CH3_SSTAT_M  (DMAC_CH3_SSTAT_V << DMAC_CH3_SSTAT_S)
#define DMAC_CH3_SSTAT_V  0xFFFFFFFFU
#define DMAC_CH3_SSTAT_S  0

/** DMAC_CH3_DSTAT0_REG register
 *  NA
 */
#define DMAC_CH3_DSTAT0_REG (DR_REG_DMAC_BASE + 0x368)
/** DMAC_CH3_DSTAT : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_DSTAT    0xFFFFFFFFU
#define DMAC_CH3_DSTAT_M  (DMAC_CH3_DSTAT_V << DMAC_CH3_DSTAT_S)
#define DMAC_CH3_DSTAT_V  0xFFFFFFFFU
#define DMAC_CH3_DSTAT_S  0

/** DMAC_CH3_SSTATAR0_REG register
 *  NA
 */
#define DMAC_CH3_SSTATAR0_REG (DR_REG_DMAC_BASE + 0x370)
/** DMAC_CH3_SSTATAR0 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_SSTATAR0    0xFFFFFFFFU
#define DMAC_CH3_SSTATAR0_M  (DMAC_CH3_SSTATAR0_V << DMAC_CH3_SSTATAR0_S)
#define DMAC_CH3_SSTATAR0_V  0xFFFFFFFFU
#define DMAC_CH3_SSTATAR0_S  0

/** DMAC_CH3_SSTATAR1_REG register
 *  NA
 */
#define DMAC_CH3_SSTATAR1_REG (DR_REG_DMAC_BASE + 0x374)
/** DMAC_CH3_SSTATAR1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_SSTATAR1    0xFFFFFFFFU
#define DMAC_CH3_SSTATAR1_M  (DMAC_CH3_SSTATAR1_V << DMAC_CH3_SSTATAR1_S)
#define DMAC_CH3_SSTATAR1_V  0xFFFFFFFFU
#define DMAC_CH3_SSTATAR1_S  0

/** DMAC_CH3_DSTATAR0_REG register
 *  NA
 */
#define DMAC_CH3_DSTATAR0_REG (DR_REG_DMAC_BASE + 0x378)
/** DMAC_CH3_DSTATAR0 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_DSTATAR0    0xFFFFFFFFU
#define DMAC_CH3_DSTATAR0_M  (DMAC_CH3_DSTATAR0_V << DMAC_CH3_DSTATAR0_S)
#define DMAC_CH3_DSTATAR0_V  0xFFFFFFFFU
#define DMAC_CH3_DSTATAR0_S  0

/** DMAC_CH3_DSTATAR1_REG register
 *  NA
 */
#define DMAC_CH3_DSTATAR1_REG (DR_REG_DMAC_BASE + 0x37c)
/** DMAC_CH3_DSTATAR1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH3_DSTATAR1    0xFFFFFFFFU
#define DMAC_CH3_DSTATAR1_M  (DMAC_CH3_DSTATAR1_V << DMAC_CH3_DSTATAR1_S)
#define DMAC_CH3_DSTATAR1_V  0xFFFFFFFFU
#define DMAC_CH3_DSTATAR1_S  0

/** DMAC_CH3_INTSTATUS_ENABLE0_REG register
 *  NA
 */
#define DMAC_CH3_INTSTATUS_ENABLE0_REG (DR_REG_DMAC_BASE + 0x380)
/** DMAC_CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT    (BIT(0))
#define DMAC_CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT_M  (DMAC_CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT_V << DMAC_CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT_S)
#define DMAC_CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT_S  0
/** DMAC_CH3_ENABLE_DMA_TFR_DONE_INTSTAT : R/W; bitpos: [1]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_DMA_TFR_DONE_INTSTAT    (BIT(1))
#define DMAC_CH3_ENABLE_DMA_TFR_DONE_INTSTAT_M  (DMAC_CH3_ENABLE_DMA_TFR_DONE_INTSTAT_V << DMAC_CH3_ENABLE_DMA_TFR_DONE_INTSTAT_S)
#define DMAC_CH3_ENABLE_DMA_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_DMA_TFR_DONE_INTSTAT_S  1
/** DMAC_CH3_ENABLE_SRC_TRANSCOMP_INTSTAT : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SRC_TRANSCOMP_INTSTAT    (BIT(3))
#define DMAC_CH3_ENABLE_SRC_TRANSCOMP_INTSTAT_M  (DMAC_CH3_ENABLE_SRC_TRANSCOMP_INTSTAT_V << DMAC_CH3_ENABLE_SRC_TRANSCOMP_INTSTAT_S)
#define DMAC_CH3_ENABLE_SRC_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SRC_TRANSCOMP_INTSTAT_S  3
/** DMAC_CH3_ENABLE_DST_TRANSCOMP_INTSTAT : R/W; bitpos: [4]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_DST_TRANSCOMP_INTSTAT    (BIT(4))
#define DMAC_CH3_ENABLE_DST_TRANSCOMP_INTSTAT_M  (DMAC_CH3_ENABLE_DST_TRANSCOMP_INTSTAT_V << DMAC_CH3_ENABLE_DST_TRANSCOMP_INTSTAT_S)
#define DMAC_CH3_ENABLE_DST_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_DST_TRANSCOMP_INTSTAT_S  4
/** DMAC_CH3_ENABLE_SRC_DEC_ERR_INTSTAT : R/W; bitpos: [5]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SRC_DEC_ERR_INTSTAT    (BIT(5))
#define DMAC_CH3_ENABLE_SRC_DEC_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SRC_DEC_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SRC_DEC_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SRC_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SRC_DEC_ERR_INTSTAT_S  5
/** DMAC_CH3_ENABLE_DST_DEC_ERR_INTSTAT : R/W; bitpos: [6]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_DST_DEC_ERR_INTSTAT    (BIT(6))
#define DMAC_CH3_ENABLE_DST_DEC_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_DST_DEC_ERR_INTSTAT_V << DMAC_CH3_ENABLE_DST_DEC_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_DST_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_DST_DEC_ERR_INTSTAT_S  6
/** DMAC_CH3_ENABLE_SRC_SLV_ERR_INTSTAT : R/W; bitpos: [7]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SRC_SLV_ERR_INTSTAT    (BIT(7))
#define DMAC_CH3_ENABLE_SRC_SLV_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SRC_SLV_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SRC_SLV_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SRC_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SRC_SLV_ERR_INTSTAT_S  7
/** DMAC_CH3_ENABLE_DST_SLV_ERR_INTSTAT : R/W; bitpos: [8]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_DST_SLV_ERR_INTSTAT    (BIT(8))
#define DMAC_CH3_ENABLE_DST_SLV_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_DST_SLV_ERR_INTSTAT_V << DMAC_CH3_ENABLE_DST_SLV_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_DST_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_DST_SLV_ERR_INTSTAT_S  8
/** DMAC_CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT : R/W; bitpos: [9]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT    (BIT(9))
#define DMAC_CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT_V << DMAC_CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT_S  9
/** DMAC_CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT : R/W; bitpos: [10]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT    (BIT(10))
#define DMAC_CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT_V << DMAC_CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT_S  10
/** DMAC_CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT : R/W; bitpos: [11]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT    (BIT(11))
#define DMAC_CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT_V << DMAC_CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT_S  11
/** DMAC_CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT : R/W; bitpos: [12]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT    (BIT(12))
#define DMAC_CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT_V << DMAC_CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT_S  12
/** DMAC_CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT : R/W; bitpos: [13]; default:
 *  1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT    (BIT(13))
#define DMAC_CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S  13
/** DMAC_CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT : R/W; bitpos: [14]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT    (BIT(14))
#define DMAC_CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S  14
/** DMAC_CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT : R/W; bitpos: [16]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT    (BIT(16))
#define DMAC_CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT_S  16
/** DMAC_CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT : R/W; bitpos: [17]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT    (BIT(17))
#define DMAC_CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_S  17
/** DMAC_CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT : R/W; bitpos: [18]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT    (BIT(18))
#define DMAC_CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_S  18
/** DMAC_CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT : R/W; bitpos: [19]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT    (BIT(19))
#define DMAC_CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_S  19
/** DMAC_CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT : R/W; bitpos: [20];
 *  default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT    (BIT(20))
#define DMAC_CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S  20
/** DMAC_CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT : R/W; bitpos: [21]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT    (BIT(21))
#define DMAC_CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_S  21
/** DMAC_CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT : RO; bitpos: [25]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT    (BIT(25))
#define DMAC_CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_M  (DMAC_CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_V << DMAC_CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_S  25
/** DMAC_CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT : R/W; bitpos: [27]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT    (BIT(27))
#define DMAC_CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT_M  (DMAC_CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT_V << DMAC_CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT_S)
#define DMAC_CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT_S  27
/** DMAC_CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT : R/W; bitpos: [28]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT    (BIT(28))
#define DMAC_CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT_M  (DMAC_CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT_V << DMAC_CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT_S)
#define DMAC_CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT_S  28
/** DMAC_CH3_ENABLE_CH_SUSPENDED_INTSTAT : R/W; bitpos: [29]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_CH_SUSPENDED_INTSTAT    (BIT(29))
#define DMAC_CH3_ENABLE_CH_SUSPENDED_INTSTAT_M  (DMAC_CH3_ENABLE_CH_SUSPENDED_INTSTAT_V << DMAC_CH3_ENABLE_CH_SUSPENDED_INTSTAT_S)
#define DMAC_CH3_ENABLE_CH_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_CH_SUSPENDED_INTSTAT_S  29
/** DMAC_CH3_ENABLE_CH_DISABLED_INTSTAT : R/W; bitpos: [30]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_CH_DISABLED_INTSTAT    (BIT(30))
#define DMAC_CH3_ENABLE_CH_DISABLED_INTSTAT_M  (DMAC_CH3_ENABLE_CH_DISABLED_INTSTAT_V << DMAC_CH3_ENABLE_CH_DISABLED_INTSTAT_S)
#define DMAC_CH3_ENABLE_CH_DISABLED_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_CH_DISABLED_INTSTAT_S  30
/** DMAC_CH3_ENABLE_CH_ABORTED_INTSTAT : R/W; bitpos: [31]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_CH_ABORTED_INTSTAT    (BIT(31))
#define DMAC_CH3_ENABLE_CH_ABORTED_INTSTAT_M  (DMAC_CH3_ENABLE_CH_ABORTED_INTSTAT_V << DMAC_CH3_ENABLE_CH_ABORTED_INTSTAT_S)
#define DMAC_CH3_ENABLE_CH_ABORTED_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_CH_ABORTED_INTSTAT_S  31

/** DMAC_CH3_INTSTATUS_ENABLE1_REG register
 *  NA
 */
#define DMAC_CH3_INTSTATUS_ENABLE1_REG (DR_REG_DMAC_BASE + 0x384)
/** DMAC_CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT : RO; bitpos: [0]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT    (BIT(0))
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_M  (DMAC_CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_V << DMAC_CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_S  0
/** DMAC_CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT : RO; bitpos: [1]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT    (BIT(1))
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_M  (DMAC_CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_V << DMAC_CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_S  1
/** DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT : RO; bitpos: [2]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT    (BIT(2))
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_M  (DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_V << DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_S  2
/** DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT : RO; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT    (BIT(3))
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_M  (DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_V << DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_S)
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_S  3

