espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH3_INTCLEAR1_REG register
 *  NA
 */
#define DMAC_CH3_INTCLEAR1_REG (DR_REG_DMAC_BASE + 0x39c)
/** DMAC_CH3_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT : WO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT    (BIT(0))
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT_M  (DMAC_CH3_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT_V << DMAC_CH3_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT_S)
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT_S  0
/** DMAC_CH3_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT    (BIT(1))
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_M  (DMAC_CH3_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_V << DMAC_CH3_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_S)
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_S  1
/** DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT : WO; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT    (BIT(2))
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT_M  (DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT_V << DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT_S)
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT_S  2
/** DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT    (BIT(3))
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_M  (DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_V << DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_S)
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH3_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_S  3

/** DMAC_CH4_SAR0_REG register
 *  NA
 */
#define DMAC_CH4_SAR0_REG (DR_REG_DMAC_BASE + 0x400)
/** DMAC_CH4_SAR0 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_SAR0    0xFFFFFFFFU
#define DMAC_CH4_SAR0_M  (DMAC_CH4_SAR0_V << DMAC_CH4_SAR0_S)
#define DMAC_CH4_SAR0_V  0xFFFFFFFFU
#define DMAC_CH4_SAR0_S  0

/** DMAC_CH4_SAR1_REG register
 *  NA
 */
#define DMAC_CH4_SAR1_REG (DR_REG_DMAC_BASE + 0x404)
/** DMAC_CH4_SAR1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_SAR1    0xFFFFFFFFU
#define DMAC_CH4_SAR1_M  (DMAC_CH4_SAR1_V << DMAC_CH4_SAR1_S)
#define DMAC_CH4_SAR1_V  0xFFFFFFFFU
#define DMAC_CH4_SAR1_S  0

/** DMAC_CH4_DAR0_REG register
 *  NA
 */
#define DMAC_CH4_DAR0_REG (DR_REG_DMAC_BASE + 0x408)
/** DMAC_CH4_DAR0 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_DAR0    0xFFFFFFFFU
#define DMAC_CH4_DAR0_M  (DMAC_CH4_DAR0_V << DMAC_CH4_DAR0_S)
#define DMAC_CH4_DAR0_V  0xFFFFFFFFU
#define DMAC_CH4_DAR0_S  0

/** DMAC_CH4_DAR1_REG register
 *  NA
 */
#define DMAC_CH4_DAR1_REG (DR_REG_DMAC_BASE + 0x40c)
/** DMAC_CH4_DAR1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_DAR1    0xFFFFFFFFU
#define DMAC_CH4_DAR1_M  (DMAC_CH4_DAR1_V << DMAC_CH4_DAR1_S)
#define DMAC_CH4_DAR1_V  0xFFFFFFFFU
#define DMAC_CH4_DAR1_S  0

/** DMAC_CH4_BLOCK_TS0_REG register
 *  NA
 */
#define DMAC_CH4_BLOCK_TS0_REG (DR_REG_DMAC_BASE + 0x410)
/** DMAC_CH4_BLOCK_TS : R/W; bitpos: [21:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_BLOCK_TS    0x003FFFFFU
#define DMAC_CH4_BLOCK_TS_M  (DMAC_CH4_BLOCK_TS_V << DMAC_CH4_BLOCK_TS_S)
#define DMAC_CH4_BLOCK_TS_V  0x003FFFFFU
#define DMAC_CH4_BLOCK_TS_S  0

/** DMAC_CH4_CTL0_REG register
 *  NA
 */
#define DMAC_CH4_CTL0_REG (DR_REG_DMAC_BASE + 0x418)
/** DMAC_CH4_SMS : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH4_SMS    (BIT(0))
#define DMAC_CH4_SMS_M  (DMAC_CH4_SMS_V << DMAC_CH4_SMS_S)
#define DMAC_CH4_SMS_V  0x00000001U
#define DMAC_CH4_SMS_S  0
/** DMAC_CH4_DMS : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH4_DMS    (BIT(2))
#define DMAC_CH4_DMS_M  (DMAC_CH4_DMS_V << DMAC_CH4_DMS_S)
#define DMAC_CH4_DMS_V  0x00000001U
#define DMAC_CH4_DMS_S  2
/** DMAC_CH4_SINC : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH4_SINC    (BIT(4))
#define DMAC_CH4_SINC_M  (DMAC_CH4_SINC_V << DMAC_CH4_SINC_S)
#define DMAC_CH4_SINC_V  0x00000001U
#define DMAC_CH4_SINC_S  4
/** DMAC_CH4_DINC : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH4_DINC    (BIT(6))
#define DMAC_CH4_DINC_M  (DMAC_CH4_DINC_V << DMAC_CH4_DINC_S)
#define DMAC_CH4_DINC_V  0x00000001U
#define DMAC_CH4_DINC_S  6
/** DMAC_CH4_SRC_TR_WIDTH : R/W; bitpos: [10:8]; default: 2;
 *  NA
 */
#define DMAC_CH4_SRC_TR_WIDTH    0x00000007U
#define DMAC_CH4_SRC_TR_WIDTH_M  (DMAC_CH4_SRC_TR_WIDTH_V << DMAC_CH4_SRC_TR_WIDTH_S)
#define DMAC_CH4_SRC_TR_WIDTH_V  0x00000007U
#define DMAC_CH4_SRC_TR_WIDTH_S  8
/** DMAC_CH4_DST_TR_WIDTH : R/W; bitpos: [13:11]; default: 2;
 *  NA
 */
#define DMAC_CH4_DST_TR_WIDTH    0x00000007U
#define DMAC_CH4_DST_TR_WIDTH_M  (DMAC_CH4_DST_TR_WIDTH_V << DMAC_CH4_DST_TR_WIDTH_S)
#define DMAC_CH4_DST_TR_WIDTH_V  0x00000007U
#define DMAC_CH4_DST_TR_WIDTH_S  11
/** DMAC_CH4_SRC_MSIZE : R/W; bitpos: [17:14]; default: 0;
 *  NA
 */
#define DMAC_CH4_SRC_MSIZE    0x0000000FU
#define DMAC_CH4_SRC_MSIZE_M  (DMAC_CH4_SRC_MSIZE_V << DMAC_CH4_SRC_MSIZE_S)
#define DMAC_CH4_SRC_MSIZE_V  0x0000000FU
#define DMAC_CH4_SRC_MSIZE_S  14
/** DMAC_CH4_DST_MSIZE : R/W; bitpos: [21:18]; default: 0;
 *  NA
 */
#define DMAC_CH4_DST_MSIZE    0x0000000FU
#define DMAC_CH4_DST_MSIZE_M  (DMAC_CH4_DST_MSIZE_V << DMAC_CH4_DST_MSIZE_S)
#define DMAC_CH4_DST_MSIZE_V  0x0000000FU
#define DMAC_CH4_DST_MSIZE_S  18
/** DMAC_CH4_AR_CACHE : R/W; bitpos: [25:22]; default: 0;
 *  NA
 */
#define DMAC_CH4_AR_CACHE    0x0000000FU
#define DMAC_CH4_AR_CACHE_M  (DMAC_CH4_AR_CACHE_V << DMAC_CH4_AR_CACHE_S)
#define DMAC_CH4_AR_CACHE_V  0x0000000FU
#define DMAC_CH4_AR_CACHE_S  22
/** DMAC_CH4_AW_CACHE : R/W; bitpos: [29:26]; default: 0;
 *  NA
 */
#define DMAC_CH4_AW_CACHE    0x0000000FU
#define DMAC_CH4_AW_CACHE_M  (DMAC_CH4_AW_CACHE_V << DMAC_CH4_AW_CACHE_S)
#define DMAC_CH4_AW_CACHE_V  0x0000000FU
#define DMAC_CH4_AW_CACHE_S  26
/** DMAC_CH4_NONPOSTED_LASTWRITE_EN : R/W; bitpos: [30]; default: 0;
 *  NA
 */
#define DMAC_CH4_NONPOSTED_LASTWRITE_EN    (BIT(30))
#define DMAC_CH4_NONPOSTED_LASTWRITE_EN_M  (DMAC_CH4_NONPOSTED_LASTWRITE_EN_V << DMAC_CH4_NONPOSTED_LASTWRITE_EN_S)
#define DMAC_CH4_NONPOSTED_LASTWRITE_EN_V  0x00000001U
#define DMAC_CH4_NONPOSTED_LASTWRITE_EN_S  30

/** DMAC_CH4_CTL1_REG register
 *  NA
 */
#define DMAC_CH4_CTL1_REG (DR_REG_DMAC_BASE + 0x41c)
/** DMAC_CH4_AR_PROT : R/W; bitpos: [2:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_AR_PROT    0x00000007U
#define DMAC_CH4_AR_PROT_M  (DMAC_CH4_AR_PROT_V << DMAC_CH4_AR_PROT_S)
#define DMAC_CH4_AR_PROT_V  0x00000007U
#define DMAC_CH4_AR_PROT_S  0
/** DMAC_CH4_AW_PROT : R/W; bitpos: [5:3]; default: 0;
 *  NA
 */
#define DMAC_CH4_AW_PROT    0x00000007U
#define DMAC_CH4_AW_PROT_M  (DMAC_CH4_AW_PROT_V << DMAC_CH4_AW_PROT_S)
#define DMAC_CH4_AW_PROT_V  0x00000007U
#define DMAC_CH4_AW_PROT_S  3
/** DMAC_CH4_ARLEN_EN : R/W; bitpos: [6]; default: 0;
 *  NA
 */
#define DMAC_CH4_ARLEN_EN    (BIT(6))
#define DMAC_CH4_ARLEN_EN_M  (DMAC_CH4_ARLEN_EN_V << DMAC_CH4_ARLEN_EN_S)
#define DMAC_CH4_ARLEN_EN_V  0x00000001U
#define DMAC_CH4_ARLEN_EN_S  6
/** DMAC_CH4_ARLEN : R/W; bitpos: [14:7]; default: 0;
 *  NA
 */
#define DMAC_CH4_ARLEN    0x000000FFU
#define DMAC_CH4_ARLEN_M  (DMAC_CH4_ARLEN_V << DMAC_CH4_ARLEN_S)
#define DMAC_CH4_ARLEN_V  0x000000FFU
#define DMAC_CH4_ARLEN_S  7
/** DMAC_CH4_AWLEN_EN : R/W; bitpos: [15]; default: 0;
 *  NA
 */
#define DMAC_CH4_AWLEN_EN    (BIT(15))
#define DMAC_CH4_AWLEN_EN_M  (DMAC_CH4_AWLEN_EN_V << DMAC_CH4_AWLEN_EN_S)
#define DMAC_CH4_AWLEN_EN_V  0x00000001U
#define DMAC_CH4_AWLEN_EN_S  15
/** DMAC_CH4_AWLEN : R/W; bitpos: [23:16]; default: 0;
 *  NA
 */
#define DMAC_CH4_AWLEN    0x000000FFU
#define DMAC_CH4_AWLEN_M  (DMAC_CH4_AWLEN_V << DMAC_CH4_AWLEN_S)
#define DMAC_CH4_AWLEN_V  0x000000FFU
#define DMAC_CH4_AWLEN_S  16
/** DMAC_CH4_SRC_STAT_EN : R/W; bitpos: [24]; default: 0;
 *  NA
 */
#define DMAC_CH4_SRC_STAT_EN    (BIT(24))
#define DMAC_CH4_SRC_STAT_EN_M  (DMAC_CH4_SRC_STAT_EN_V << DMAC_CH4_SRC_STAT_EN_S)
#define DMAC_CH4_SRC_STAT_EN_V  0x00000001U
#define DMAC_CH4_SRC_STAT_EN_S  24
/** DMAC_CH4_DST_STAT_EN : R/W; bitpos: [25]; default: 0;
 *  NA
 */
#define DMAC_CH4_DST_STAT_EN    (BIT(25))
#define DMAC_CH4_DST_STAT_EN_M  (DMAC_CH4_DST_STAT_EN_V << DMAC_CH4_DST_STAT_EN_S)
#define DMAC_CH4_DST_STAT_EN_V  0x00000001U
#define DMAC_CH4_DST_STAT_EN_S  25
/** DMAC_CH4_IOC_BLKTFR : R/W; bitpos: [26]; default: 0;
 *  NA
 */
#define DMAC_CH4_IOC_BLKTFR    (BIT(26))
#define DMAC_CH4_IOC_BLKTFR_M  (DMAC_CH4_IOC_BLKTFR_V << DMAC_CH4_IOC_BLKTFR_S)
#define DMAC_CH4_IOC_BLKTFR_V  0x00000001U
#define DMAC_CH4_IOC_BLKTFR_S  26
/** DMAC_CH4_SHADOWREG_OR_LLI_LAST : R/W; bitpos: [30]; default: 0;
 *  NA
 */
#define DMAC_CH4_SHADOWREG_OR_LLI_LAST    (BIT(30))
#define DMAC_CH4_SHADOWREG_OR_LLI_LAST_M  (DMAC_CH4_SHADOWREG_OR_LLI_LAST_V << DMAC_CH4_SHADOWREG_OR_LLI_LAST_S)
#define DMAC_CH4_SHADOWREG_OR_LLI_LAST_V  0x00000001U
#define DMAC_CH4_SHADOWREG_OR_LLI_LAST_S  30
/** DMAC_CH4_SHADOWREG_OR_LLI_VALID : R/W; bitpos: [31]; default: 0;
 *  NA
 */
#define DMAC_CH4_SHADOWREG_OR_LLI_VALID    (BIT(31))
#define DMAC_CH4_SHADOWREG_OR_LLI_VALID_M  (DMAC_CH4_SHADOWREG_OR_LLI_VALID_V << DMAC_CH4_SHADOWREG_OR_LLI_VALID_S)
#define DMAC_CH4_SHADOWREG_OR_LLI_VALID_V  0x00000001U
#define DMAC_CH4_SHADOWREG_OR_LLI_VALID_S  31

