espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/dw_gdma_reg.h
/** DMAC_CH4_SWHSDST0_REG register
 *  NA
 */
#define DMAC_CH4_SWHSDST0_REG (DR_REG_DMAC_BASE + 0x440)
/** DMAC_CH4_SWHS_REQ_DST : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH4_SWHS_REQ_DST    (BIT(0))
#define DMAC_CH4_SWHS_REQ_DST_M  (DMAC_CH4_SWHS_REQ_DST_V << DMAC_CH4_SWHS_REQ_DST_S)
#define DMAC_CH4_SWHS_REQ_DST_V  0x00000001U
#define DMAC_CH4_SWHS_REQ_DST_S  0
/** DMAC_CH4_SWHS_REQ_DST_WE : WO; bitpos: [1]; default: 0;
 *  NA
 */
#define DMAC_CH4_SWHS_REQ_DST_WE    (BIT(1))
#define DMAC_CH4_SWHS_REQ_DST_WE_M  (DMAC_CH4_SWHS_REQ_DST_WE_V << DMAC_CH4_SWHS_REQ_DST_WE_S)
#define DMAC_CH4_SWHS_REQ_DST_WE_V  0x00000001U
#define DMAC_CH4_SWHS_REQ_DST_WE_S  1
/** DMAC_CH4_SWHS_SGLREQ_DST : R/W; bitpos: [2]; default: 0;
 *  NA
 */
#define DMAC_CH4_SWHS_SGLREQ_DST    (BIT(2))
#define DMAC_CH4_SWHS_SGLREQ_DST_M  (DMAC_CH4_SWHS_SGLREQ_DST_V << DMAC_CH4_SWHS_SGLREQ_DST_S)
#define DMAC_CH4_SWHS_SGLREQ_DST_V  0x00000001U
#define DMAC_CH4_SWHS_SGLREQ_DST_S  2
/** DMAC_CH4_SWHS_SGLREQ_DST_WE : WO; bitpos: [3]; default: 0;
 *  NA
 */
#define DMAC_CH4_SWHS_SGLREQ_DST_WE    (BIT(3))
#define DMAC_CH4_SWHS_SGLREQ_DST_WE_M  (DMAC_CH4_SWHS_SGLREQ_DST_WE_V << DMAC_CH4_SWHS_SGLREQ_DST_WE_S)
#define DMAC_CH4_SWHS_SGLREQ_DST_WE_V  0x00000001U
#define DMAC_CH4_SWHS_SGLREQ_DST_WE_S  3
/** DMAC_CH4_SWHS_LST_DST : R/W; bitpos: [4]; default: 0;
 *  NA
 */
#define DMAC_CH4_SWHS_LST_DST    (BIT(4))
#define DMAC_CH4_SWHS_LST_DST_M  (DMAC_CH4_SWHS_LST_DST_V << DMAC_CH4_SWHS_LST_DST_S)
#define DMAC_CH4_SWHS_LST_DST_V  0x00000001U
#define DMAC_CH4_SWHS_LST_DST_S  4
/** DMAC_CH4_SWHS_LST_DST_WE : WO; bitpos: [5]; default: 0;
 *  NA
 */
#define DMAC_CH4_SWHS_LST_DST_WE    (BIT(5))
#define DMAC_CH4_SWHS_LST_DST_WE_M  (DMAC_CH4_SWHS_LST_DST_WE_V << DMAC_CH4_SWHS_LST_DST_WE_S)
#define DMAC_CH4_SWHS_LST_DST_WE_V  0x00000001U
#define DMAC_CH4_SWHS_LST_DST_WE_S  5

/** DMAC_CH4_BLK_TFR_RESUMEREQ0_REG register
 *  NA
 */
#define DMAC_CH4_BLK_TFR_RESUMEREQ0_REG (DR_REG_DMAC_BASE + 0x448)
/** DMAC_CH4_BLK_TFR_RESUMEREQ : WO; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH4_BLK_TFR_RESUMEREQ    (BIT(0))
#define DMAC_CH4_BLK_TFR_RESUMEREQ_M  (DMAC_CH4_BLK_TFR_RESUMEREQ_V << DMAC_CH4_BLK_TFR_RESUMEREQ_S)
#define DMAC_CH4_BLK_TFR_RESUMEREQ_V  0x00000001U
#define DMAC_CH4_BLK_TFR_RESUMEREQ_S  0

/** DMAC_CH4_AXI_ID0_REG register
 *  NA
 */
#define DMAC_CH4_AXI_ID0_REG (DR_REG_DMAC_BASE + 0x450)
/** DMAC_CH4_AXI_READ_ID_SUFFIX : R/W; bitpos: [0]; default: 0;
 *  NA
 */
#define DMAC_CH4_AXI_READ_ID_SUFFIX    (BIT(0))
#define DMAC_CH4_AXI_READ_ID_SUFFIX_M  (DMAC_CH4_AXI_READ_ID_SUFFIX_V << DMAC_CH4_AXI_READ_ID_SUFFIX_S)
#define DMAC_CH4_AXI_READ_ID_SUFFIX_V  0x00000001U
#define DMAC_CH4_AXI_READ_ID_SUFFIX_S  0
/** DMAC_CH4_AXI_WRITE_ID_SUFFIX : R/W; bitpos: [16]; default: 0;
 *  NA
 */
#define DMAC_CH4_AXI_WRITE_ID_SUFFIX    (BIT(16))
#define DMAC_CH4_AXI_WRITE_ID_SUFFIX_M  (DMAC_CH4_AXI_WRITE_ID_SUFFIX_V << DMAC_CH4_AXI_WRITE_ID_SUFFIX_S)
#define DMAC_CH4_AXI_WRITE_ID_SUFFIX_V  0x00000001U
#define DMAC_CH4_AXI_WRITE_ID_SUFFIX_S  16

/** DMAC_CH4_AXI_QOS0_REG register
 *  NA
 */
#define DMAC_CH4_AXI_QOS0_REG (DR_REG_DMAC_BASE + 0x458)
/** DMAC_CH4_AXI_AWQOS : R/W; bitpos: [3:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_AXI_AWQOS    0x0000000FU
#define DMAC_CH4_AXI_AWQOS_M  (DMAC_CH4_AXI_AWQOS_V << DMAC_CH4_AXI_AWQOS_S)
#define DMAC_CH4_AXI_AWQOS_V  0x0000000FU
#define DMAC_CH4_AXI_AWQOS_S  0
/** DMAC_CH4_AXI_ARQOS : R/W; bitpos: [7:4]; default: 0;
 *  NA
 */
#define DMAC_CH4_AXI_ARQOS    0x0000000FU
#define DMAC_CH4_AXI_ARQOS_M  (DMAC_CH4_AXI_ARQOS_V << DMAC_CH4_AXI_ARQOS_S)
#define DMAC_CH4_AXI_ARQOS_V  0x0000000FU
#define DMAC_CH4_AXI_ARQOS_S  4

/** DMAC_CH4_SSTAT0_REG register
 *  NA
 */
#define DMAC_CH4_SSTAT0_REG (DR_REG_DMAC_BASE + 0x460)
/** DMAC_CH4_SSTAT : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_SSTAT    0xFFFFFFFFU
#define DMAC_CH4_SSTAT_M  (DMAC_CH4_SSTAT_V << DMAC_CH4_SSTAT_S)
#define DMAC_CH4_SSTAT_V  0xFFFFFFFFU
#define DMAC_CH4_SSTAT_S  0

/** DMAC_CH4_DSTAT0_REG register
 *  NA
 */
#define DMAC_CH4_DSTAT0_REG (DR_REG_DMAC_BASE + 0x468)
/** DMAC_CH4_DSTAT : RO; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_DSTAT    0xFFFFFFFFU
#define DMAC_CH4_DSTAT_M  (DMAC_CH4_DSTAT_V << DMAC_CH4_DSTAT_S)
#define DMAC_CH4_DSTAT_V  0xFFFFFFFFU
#define DMAC_CH4_DSTAT_S  0

/** DMAC_CH4_SSTATAR0_REG register
 *  NA
 */
#define DMAC_CH4_SSTATAR0_REG (DR_REG_DMAC_BASE + 0x470)
/** DMAC_CH4_SSTATAR0 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_SSTATAR0    0xFFFFFFFFU
#define DMAC_CH4_SSTATAR0_M  (DMAC_CH4_SSTATAR0_V << DMAC_CH4_SSTATAR0_S)
#define DMAC_CH4_SSTATAR0_V  0xFFFFFFFFU
#define DMAC_CH4_SSTATAR0_S  0

/** DMAC_CH4_SSTATAR1_REG register
 *  NA
 */
#define DMAC_CH4_SSTATAR1_REG (DR_REG_DMAC_BASE + 0x474)
/** DMAC_CH4_SSTATAR1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_SSTATAR1    0xFFFFFFFFU
#define DMAC_CH4_SSTATAR1_M  (DMAC_CH4_SSTATAR1_V << DMAC_CH4_SSTATAR1_S)
#define DMAC_CH4_SSTATAR1_V  0xFFFFFFFFU
#define DMAC_CH4_SSTATAR1_S  0

/** DMAC_CH4_DSTATAR0_REG register
 *  NA
 */
#define DMAC_CH4_DSTATAR0_REG (DR_REG_DMAC_BASE + 0x478)
/** DMAC_CH4_DSTATAR0 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_DSTATAR0    0xFFFFFFFFU
#define DMAC_CH4_DSTATAR0_M  (DMAC_CH4_DSTATAR0_V << DMAC_CH4_DSTATAR0_S)
#define DMAC_CH4_DSTATAR0_V  0xFFFFFFFFU
#define DMAC_CH4_DSTATAR0_S  0

/** DMAC_CH4_DSTATAR1_REG register
 *  NA
 */
#define DMAC_CH4_DSTATAR1_REG (DR_REG_DMAC_BASE + 0x47c)
/** DMAC_CH4_DSTATAR1 : R/W; bitpos: [31:0]; default: 0;
 *  NA
 */
#define DMAC_CH4_DSTATAR1    0xFFFFFFFFU
#define DMAC_CH4_DSTATAR1_M  (DMAC_CH4_DSTATAR1_V << DMAC_CH4_DSTATAR1_S)
#define DMAC_CH4_DSTATAR1_V  0xFFFFFFFFU
#define DMAC_CH4_DSTATAR1_S  0

/** DMAC_CH4_INTSTATUS_ENABLE0_REG register
 *  NA
 */
#define DMAC_CH4_INTSTATUS_ENABLE0_REG (DR_REG_DMAC_BASE + 0x480)
/** DMAC_CH4_ENABLE_BLOCK_TFR_DONE_INTSTAT : R/W; bitpos: [0]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_BLOCK_TFR_DONE_INTSTAT    (BIT(0))
#define DMAC_CH4_ENABLE_BLOCK_TFR_DONE_INTSTAT_M  (DMAC_CH4_ENABLE_BLOCK_TFR_DONE_INTSTAT_V << DMAC_CH4_ENABLE_BLOCK_TFR_DONE_INTSTAT_S)
#define DMAC_CH4_ENABLE_BLOCK_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_BLOCK_TFR_DONE_INTSTAT_S  0
/** DMAC_CH4_ENABLE_DMA_TFR_DONE_INTSTAT : R/W; bitpos: [1]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_DMA_TFR_DONE_INTSTAT    (BIT(1))
#define DMAC_CH4_ENABLE_DMA_TFR_DONE_INTSTAT_M  (DMAC_CH4_ENABLE_DMA_TFR_DONE_INTSTAT_V << DMAC_CH4_ENABLE_DMA_TFR_DONE_INTSTAT_S)
#define DMAC_CH4_ENABLE_DMA_TFR_DONE_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_DMA_TFR_DONE_INTSTAT_S  1
/** DMAC_CH4_ENABLE_SRC_TRANSCOMP_INTSTAT : R/W; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SRC_TRANSCOMP_INTSTAT    (BIT(3))
#define DMAC_CH4_ENABLE_SRC_TRANSCOMP_INTSTAT_M  (DMAC_CH4_ENABLE_SRC_TRANSCOMP_INTSTAT_V << DMAC_CH4_ENABLE_SRC_TRANSCOMP_INTSTAT_S)
#define DMAC_CH4_ENABLE_SRC_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SRC_TRANSCOMP_INTSTAT_S  3
/** DMAC_CH4_ENABLE_DST_TRANSCOMP_INTSTAT : R/W; bitpos: [4]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_DST_TRANSCOMP_INTSTAT    (BIT(4))
#define DMAC_CH4_ENABLE_DST_TRANSCOMP_INTSTAT_M  (DMAC_CH4_ENABLE_DST_TRANSCOMP_INTSTAT_V << DMAC_CH4_ENABLE_DST_TRANSCOMP_INTSTAT_S)
#define DMAC_CH4_ENABLE_DST_TRANSCOMP_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_DST_TRANSCOMP_INTSTAT_S  4
/** DMAC_CH4_ENABLE_SRC_DEC_ERR_INTSTAT : R/W; bitpos: [5]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SRC_DEC_ERR_INTSTAT    (BIT(5))
#define DMAC_CH4_ENABLE_SRC_DEC_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SRC_DEC_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SRC_DEC_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SRC_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SRC_DEC_ERR_INTSTAT_S  5
/** DMAC_CH4_ENABLE_DST_DEC_ERR_INTSTAT : R/W; bitpos: [6]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_DST_DEC_ERR_INTSTAT    (BIT(6))
#define DMAC_CH4_ENABLE_DST_DEC_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_DST_DEC_ERR_INTSTAT_V << DMAC_CH4_ENABLE_DST_DEC_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_DST_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_DST_DEC_ERR_INTSTAT_S  6
/** DMAC_CH4_ENABLE_SRC_SLV_ERR_INTSTAT : R/W; bitpos: [7]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SRC_SLV_ERR_INTSTAT    (BIT(7))
#define DMAC_CH4_ENABLE_SRC_SLV_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SRC_SLV_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SRC_SLV_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SRC_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SRC_SLV_ERR_INTSTAT_S  7
/** DMAC_CH4_ENABLE_DST_SLV_ERR_INTSTAT : R/W; bitpos: [8]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_DST_SLV_ERR_INTSTAT    (BIT(8))
#define DMAC_CH4_ENABLE_DST_SLV_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_DST_SLV_ERR_INTSTAT_V << DMAC_CH4_ENABLE_DST_SLV_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_DST_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_DST_SLV_ERR_INTSTAT_S  8
/** DMAC_CH4_ENABLE_LLI_RD_DEC_ERR_INTSTAT : R/W; bitpos: [9]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_LLI_RD_DEC_ERR_INTSTAT    (BIT(9))
#define DMAC_CH4_ENABLE_LLI_RD_DEC_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_LLI_RD_DEC_ERR_INTSTAT_V << DMAC_CH4_ENABLE_LLI_RD_DEC_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_LLI_RD_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_LLI_RD_DEC_ERR_INTSTAT_S  9
/** DMAC_CH4_ENABLE_LLI_WR_DEC_ERR_INTSTAT : R/W; bitpos: [10]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_LLI_WR_DEC_ERR_INTSTAT    (BIT(10))
#define DMAC_CH4_ENABLE_LLI_WR_DEC_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_LLI_WR_DEC_ERR_INTSTAT_V << DMAC_CH4_ENABLE_LLI_WR_DEC_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_LLI_WR_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_LLI_WR_DEC_ERR_INTSTAT_S  10
/** DMAC_CH4_ENABLE_LLI_RD_SLV_ERR_INTSTAT : R/W; bitpos: [11]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_LLI_RD_SLV_ERR_INTSTAT    (BIT(11))
#define DMAC_CH4_ENABLE_LLI_RD_SLV_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_LLI_RD_SLV_ERR_INTSTAT_V << DMAC_CH4_ENABLE_LLI_RD_SLV_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_LLI_RD_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_LLI_RD_SLV_ERR_INTSTAT_S  11
/** DMAC_CH4_ENABLE_LLI_WR_SLV_ERR_INTSTAT : R/W; bitpos: [12]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_LLI_WR_SLV_ERR_INTSTAT    (BIT(12))
#define DMAC_CH4_ENABLE_LLI_WR_SLV_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_LLI_WR_SLV_ERR_INTSTAT_V << DMAC_CH4_ENABLE_LLI_WR_SLV_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_LLI_WR_SLV_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_LLI_WR_SLV_ERR_INTSTAT_S  12
/** DMAC_CH4_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT : R/W; bitpos: [13]; default:
 *  1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT    (BIT(13))
#define DMAC_CH4_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT_S  13
/** DMAC_CH4_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT : R/W; bitpos: [14]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT    (BIT(14))
#define DMAC_CH4_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT_S  14
/** DMAC_CH4_ENABLE_SLVIF_DEC_ERR_INTSTAT : R/W; bitpos: [16]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_DEC_ERR_INTSTAT    (BIT(16))
#define DMAC_CH4_ENABLE_SLVIF_DEC_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_DEC_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_DEC_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_DEC_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_DEC_ERR_INTSTAT_S  16
/** DMAC_CH4_ENABLE_SLVIF_WR2RO_ERR_INTSTAT : R/W; bitpos: [17]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_WR2RO_ERR_INTSTAT    (BIT(17))
#define DMAC_CH4_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_WR2RO_ERR_INTSTAT_S  17
/** DMAC_CH4_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT : R/W; bitpos: [18]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT    (BIT(18))
#define DMAC_CH4_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT_S  18
/** DMAC_CH4_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT : R/W; bitpos: [19]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT    (BIT(19))
#define DMAC_CH4_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT_S  19
/** DMAC_CH4_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT : R/W; bitpos: [20];
 *  default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT    (BIT(20))
#define DMAC_CH4_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT_S  20
/** DMAC_CH4_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT : R/W; bitpos: [21]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT    (BIT(21))
#define DMAC_CH4_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT_S  21
/** DMAC_CH4_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT : RO; bitpos: [25]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT    (BIT(25))
#define DMAC_CH4_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_M  (DMAC_CH4_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_V << DMAC_CH4_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT_S  25
/** DMAC_CH4_ENABLE_CH_LOCK_CLEARED_INTSTAT : R/W; bitpos: [27]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_CH_LOCK_CLEARED_INTSTAT    (BIT(27))
#define DMAC_CH4_ENABLE_CH_LOCK_CLEARED_INTSTAT_M  (DMAC_CH4_ENABLE_CH_LOCK_CLEARED_INTSTAT_V << DMAC_CH4_ENABLE_CH_LOCK_CLEARED_INTSTAT_S)
#define DMAC_CH4_ENABLE_CH_LOCK_CLEARED_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_CH_LOCK_CLEARED_INTSTAT_S  27
/** DMAC_CH4_ENABLE_CH_SRC_SUSPENDED_INTSTAT : R/W; bitpos: [28]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_CH_SRC_SUSPENDED_INTSTAT    (BIT(28))
#define DMAC_CH4_ENABLE_CH_SRC_SUSPENDED_INTSTAT_M  (DMAC_CH4_ENABLE_CH_SRC_SUSPENDED_INTSTAT_V << DMAC_CH4_ENABLE_CH_SRC_SUSPENDED_INTSTAT_S)
#define DMAC_CH4_ENABLE_CH_SRC_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_CH_SRC_SUSPENDED_INTSTAT_S  28
/** DMAC_CH4_ENABLE_CH_SUSPENDED_INTSTAT : R/W; bitpos: [29]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_CH_SUSPENDED_INTSTAT    (BIT(29))
#define DMAC_CH4_ENABLE_CH_SUSPENDED_INTSTAT_M  (DMAC_CH4_ENABLE_CH_SUSPENDED_INTSTAT_V << DMAC_CH4_ENABLE_CH_SUSPENDED_INTSTAT_S)
#define DMAC_CH4_ENABLE_CH_SUSPENDED_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_CH_SUSPENDED_INTSTAT_S  29
/** DMAC_CH4_ENABLE_CH_DISABLED_INTSTAT : R/W; bitpos: [30]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_CH_DISABLED_INTSTAT    (BIT(30))
#define DMAC_CH4_ENABLE_CH_DISABLED_INTSTAT_M  (DMAC_CH4_ENABLE_CH_DISABLED_INTSTAT_V << DMAC_CH4_ENABLE_CH_DISABLED_INTSTAT_S)
#define DMAC_CH4_ENABLE_CH_DISABLED_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_CH_DISABLED_INTSTAT_S  30
/** DMAC_CH4_ENABLE_CH_ABORTED_INTSTAT : R/W; bitpos: [31]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_CH_ABORTED_INTSTAT    (BIT(31))
#define DMAC_CH4_ENABLE_CH_ABORTED_INTSTAT_M  (DMAC_CH4_ENABLE_CH_ABORTED_INTSTAT_V << DMAC_CH4_ENABLE_CH_ABORTED_INTSTAT_S)
#define DMAC_CH4_ENABLE_CH_ABORTED_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_CH_ABORTED_INTSTAT_S  31

/** DMAC_CH4_INTSTATUS_ENABLE1_REG register
 *  NA
 */
#define DMAC_CH4_INTSTATUS_ENABLE1_REG (DR_REG_DMAC_BASE + 0x484)
/** DMAC_CH4_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT : RO; bitpos: [0]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT    (BIT(0))
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_M  (DMAC_CH4_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_V << DMAC_CH4_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT_S  0
/** DMAC_CH4_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT : RO; bitpos: [1]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT    (BIT(1))
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_M  (DMAC_CH4_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_V << DMAC_CH4_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT_S  1
/** DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT : RO; bitpos: [2]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT    (BIT(2))
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_M  (DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_V << DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT_S  2
/** DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT : RO; bitpos: [3]; default: 1;
 *  NA
 */
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT    (BIT(3))
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_M  (DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_V << DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_S)
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_V  0x00000001U
#define DMAC_CH4_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT_S  3

